Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_LCDISR : (LCDC Offset: 0x38) ( R/ 32) LCD Controller Interrupt Status Register -------- */
#define LCDC_LCDISR_SOF_Pos                   _U_(0)                                               /**< (LCDC_LCDISR) Start of Frame Interrupt Status Position */
#define LCDC_LCDISR_SOF_Msk                   (_U_(0x1) << LCDC_LCDISR_SOF_Pos)                    /**< (LCDC_LCDISR) Start of Frame Interrupt Status Mask */
#define LCDC_LCDISR_SOF(value)                (LCDC_LCDISR_SOF_Msk & ((value) << LCDC_LCDISR_SOF_Pos))
#define LCDC_LCDISR_DIS_Pos                   _U_(1)                                               /**< (LCDC_LCDISR) LCD Disable Interrupt Status Position */
#define LCDC_LCDISR_DIS_Msk                   (_U_(0x1) << LCDC_LCDISR_DIS_Pos)                    /**< (LCDC_LCDISR) LCD Disable Interrupt Status Mask */
#define LCDC_LCDISR_DIS(value)                (LCDC_LCDISR_DIS_Msk & ((value) << LCDC_LCDISR_DIS_Pos))
#define LCDC_LCDISR_DISP_Pos                  _U_(2)                                               /**< (LCDC_LCDISR) Powerup/Powerdown Sequence Terminated Interrupt Status Position */
#define LCDC_LCDISR_DISP_Msk                  (_U_(0x1) << LCDC_LCDISR_DISP_Pos)                   /**< (LCDC_LCDISR) Powerup/Powerdown Sequence Terminated Interrupt Status Mask */
#define LCDC_LCDISR_DISP(value)               (LCDC_LCDISR_DISP_Msk & ((value) << LCDC_LCDISR_DISP_Pos))
#define LCDC_LCDISR_ROW_Pos                   _U_(3)                                               /**< (LCDC_LCDISR) Row Interrupt Status Position */
#define LCDC_LCDISR_ROW_Msk                   (_U_(0x1) << LCDC_LCDISR_ROW_Pos)                    /**< (LCDC_LCDISR) Row Interrupt Status Mask */
#define LCDC_LCDISR_ROW(value)                (LCDC_LCDISR_ROW_Msk & ((value) << LCDC_LCDISR_ROW_Pos))
#define LCDC_LCDISR_FIFOERR_Pos               _U_(4)                                               /**< (LCDC_LCDISR) Output FIFO Error Position */
#define LCDC_LCDISR_FIFOERR_Msk               (_U_(0x1) << LCDC_LCDISR_FIFOERR_Pos)                /**< (LCDC_LCDISR) Output FIFO Error Mask */
#define LCDC_LCDISR_FIFOERR(value)            (LCDC_LCDISR_FIFOERR_Msk & ((value) << LCDC_LCDISR_FIFOERR_Pos))
#define LCDC_LCDISR_BASE_Pos                  _U_(8)                                               /**< (LCDC_LCDISR) Base Layer Raw Interrupt Status Position */
#define LCDC_LCDISR_BASE_Msk                  (_U_(0x1) << LCDC_LCDISR_BASE_Pos)                   /**< (LCDC_LCDISR) Base Layer Raw Interrupt Status Mask */
#define LCDC_LCDISR_BASE(value)               (LCDC_LCDISR_BASE_Msk & ((value) << LCDC_LCDISR_BASE_Pos))
#define LCDC_LCDISR_OVR1_Pos                  _U_(9)                                               /**< (LCDC_LCDISR) Overlay 1 Raw Interrupt Status Position */
#define LCDC_LCDISR_OVR1_Msk                  (_U_(0x1) << LCDC_LCDISR_OVR1_Pos)                   /**< (LCDC_LCDISR) Overlay 1 Raw Interrupt Status Mask */
#define LCDC_LCDISR_OVR1(value)               (LCDC_LCDISR_OVR1_Msk & ((value) << LCDC_LCDISR_OVR1_Pos))
#define LCDC_LCDISR_OVR2_Pos                  _U_(10)                                              /**< (LCDC_LCDISR) Overlay 2 Raw Interrupt Status Position */
#define LCDC_LCDISR_OVR2_Msk                  (_U_(0x1) << LCDC_LCDISR_OVR2_Pos)                   /**< (LCDC_LCDISR) Overlay 2 Raw Interrupt Status Mask */
#define LCDC_LCDISR_OVR2(value)               (LCDC_LCDISR_OVR2_Msk & ((value) << LCDC_LCDISR_OVR2_Pos))
#define LCDC_LCDISR_HEO_Pos                   _U_(11)                                              /**< (LCDC_LCDISR) High-End Overlay Raw Interrupt Status Position */
#define LCDC_LCDISR_HEO_Msk                   (_U_(0x1) << LCDC_LCDISR_HEO_Pos)                    /**< (LCDC_LCDISR) High-End Overlay Raw Interrupt Status Mask */
#define LCDC_LCDISR_HEO(value)                (LCDC_LCDISR_HEO_Msk & ((value) << LCDC_LCDISR_HEO_Pos))
#define LCDC_LCDISR_Msk                       _U_(0x00000F1F)                                      /**< (LCDC_LCDISR) Register Mask  */

#define LCDC_LCDISR_OVR_Pos                   _U_(9)                                               /**< (LCDC_LCDISR Position) Overlay x Raw Interrupt Status */
#define LCDC_LCDISR_OVR_Msk                   (_U_(0x3) << LCDC_LCDISR_OVR_Pos)                    /**< (LCDC_LCDISR Mask) OVR */
#define LCDC_LCDISR_OVR(value)                (LCDC_LCDISR_OVR_Msk & ((value) << LCDC_LCDISR_OVR_Pos)) 

/* -------- LCDC_ATTR : (LCDC Offset: 0x3C) ( /W 32) LCD Controller Attribute Register -------- */
#define LCDC_ATTR_BASE_Pos                    _U_(0)                                               /**< (LCDC_ATTR) Base Layer Update Attribute Position */
#define LCDC_ATTR_BASE_Msk                    (_U_(0x1) << LCDC_ATTR_BASE_Pos)                     /**< (LCDC_ATTR) Base Layer Update Attribute Mask */
#define LCDC_ATTR_BASE(value)                 (LCDC_ATTR_BASE_Msk & ((value) << LCDC_ATTR_BASE_Pos))
#define LCDC_ATTR_OVR1_Pos                    _U_(1)                                               /**< (LCDC_ATTR) Overlay 1 Update Attribute Position */
#define LCDC_ATTR_OVR1_Msk                    (_U_(0x1) << LCDC_ATTR_OVR1_Pos)                     /**< (LCDC_ATTR) Overlay 1 Update Attribute Mask */
#define LCDC_ATTR_OVR1(value)                 (LCDC_ATTR_OVR1_Msk & ((value) << LCDC_ATTR_OVR1_Pos))
#define LCDC_ATTR_OVR2_Pos                    _U_(2)                                               /**< (LCDC_ATTR) Overlay 2 Update Attribute Position */
#define LCDC_ATTR_OVR2_Msk                    (_U_(0x1) << LCDC_ATTR_OVR2_Pos)                     /**< (LCDC_ATTR) Overlay 2 Update Attribute Mask */
#define LCDC_ATTR_OVR2(value)                 (LCDC_ATTR_OVR2_Msk & ((value) << LCDC_ATTR_OVR2_Pos))
#define LCDC_ATTR_HEO_Pos                     _U_(3)                                               /**< (LCDC_ATTR) High-End Overlay Update Attribute Position */
#define LCDC_ATTR_HEO_Msk                     (_U_(0x1) << LCDC_ATTR_HEO_Pos)                      /**< (LCDC_ATTR) High-End Overlay Update Attribute Mask */
#define LCDC_ATTR_HEO(value)                  (LCDC_ATTR_HEO_Msk & ((value) << LCDC_ATTR_HEO_Pos))
#define LCDC_ATTR_BASEA2Q_Pos                 _U_(8)                                               /**< (LCDC_ATTR) Base Layer Update Add To Queue Position */
#define LCDC_ATTR_BASEA2Q_Msk                 (_U_(0x1) << LCDC_ATTR_BASEA2Q_Pos)                  /**< (LCDC_ATTR) Base Layer Update Add To Queue Mask */
#define LCDC_ATTR_BASEA2Q(value)              (LCDC_ATTR_BASEA2Q_Msk & ((value) << LCDC_ATTR_BASEA2Q_Pos))
#define LCDC_ATTR_OVR1A2Q_Pos                 _U_(9)                                               /**< (LCDC_ATTR) Overlay 1 Update Add To Queue Position */
#define LCDC_ATTR_OVR1A2Q_Msk                 (_U_(0x1) << LCDC_ATTR_OVR1A2Q_Pos)                  /**< (LCDC_ATTR) Overlay 1 Update Add To Queue Mask */
#define LCDC_ATTR_OVR1A2Q(value)              (LCDC_ATTR_OVR1A2Q_Msk & ((value) << LCDC_ATTR_OVR1A2Q_Pos))
#define LCDC_ATTR_OVR2A2Q_Pos                 _U_(10)                                              /**< (LCDC_ATTR) Overlay 2 Update Add to Queue Position */
#define LCDC_ATTR_OVR2A2Q_Msk                 (_U_(0x1) << LCDC_ATTR_OVR2A2Q_Pos)                  /**< (LCDC_ATTR) Overlay 2 Update Add to Queue Mask */
#define LCDC_ATTR_OVR2A2Q(value)              (LCDC_ATTR_OVR2A2Q_Msk & ((value) << LCDC_ATTR_OVR2A2Q_Pos))
#define LCDC_ATTR_HEOA2Q_Pos                  _U_(11)                                              /**< (LCDC_ATTR) High-End Overlay Update Add To Queue Position */
#define LCDC_ATTR_HEOA2Q_Msk                  (_U_(0x1) << LCDC_ATTR_HEOA2Q_Pos)                   /**< (LCDC_ATTR) High-End Overlay Update Add To Queue Mask */
#define LCDC_ATTR_HEOA2Q(value)               (LCDC_ATTR_HEOA2Q_Msk & ((value) << LCDC_ATTR_HEOA2Q_Pos))
#define LCDC_ATTR_Msk                         _U_(0x00000F0F)                                      /**< (LCDC_ATTR) Register Mask  */

#define LCDC_ATTR_OVR_Pos                     _U_(1)                                               /**< (LCDC_ATTR Position) Overlay x Update Attribute */
#define LCDC_ATTR_OVR_Msk                     (_U_(0x3) << LCDC_ATTR_OVR_Pos)                      /**< (LCDC_ATTR Mask) OVR */
#define LCDC_ATTR_OVR(value)                  (LCDC_ATTR_OVR_Msk & ((value) << LCDC_ATTR_OVR_Pos)) 

/* -------- LCDC_QOSCFG : (LCDC Offset: 0x40) (R/W 32) LCD Controller QoS Configuration Register -------- */
#define LCDC_QOSCFG_QOSLOCK_Pos               _U_(0)                                               /**< (LCDC_QOSCFG) Quality Of Service Lock Position */
#define LCDC_QOSCFG_QOSLOCK_Msk               (_U_(0x1) << LCDC_QOSCFG_QOSLOCK_Pos)                /**< (LCDC_QOSCFG) Quality Of Service Lock Mask */
#define LCDC_QOSCFG_QOSLOCK(value)            (LCDC_QOSCFG_QOSLOCK_Msk & ((value) << LCDC_QOSCFG_QOSLOCK_Pos))
#define LCDC_QOSCFG_QOS1CFG_Pos               _U_(4)                                               /**< (LCDC_QOSCFG) Quality Of Service for 0 to 1 Transition Position */
#define LCDC_QOSCFG_QOS1CFG_Msk               (_U_(0x3) << LCDC_QOSCFG_QOS1CFG_Pos)                /**< (LCDC_QOSCFG) Quality Of Service for 0 to 1 Transition Mask */
#define LCDC_QOSCFG_QOS1CFG(value)            (LCDC_QOSCFG_QOS1CFG_Msk & ((value) << LCDC_QOSCFG_QOS1CFG_Pos))
#define LCDC_QOSCFG_QOS2CFG_Pos               _U_(8)                                               /**< (LCDC_QOSCFG) Quality Of Service for 1 to 2 Transition Position */
#define LCDC_QOSCFG_QOS2CFG_Msk               (_U_(0x3) << LCDC_QOSCFG_QOS2CFG_Pos)                /**< (LCDC_QOSCFG) Quality Of Service for 1 to 2 Transition Mask */
#define LCDC_QOSCFG_QOS2CFG(value)            (LCDC_QOSCFG_QOS2CFG_Msk & ((value) << LCDC_QOSCFG_QOS2CFG_Pos))
#define LCDC_QOSCFG_QOS3CFG_Pos               _U_(12)                                              /**< (LCDC_QOSCFG) Quality Of Service for 2 to 3 Transition Position */
#define LCDC_QOSCFG_QOS3CFG_Msk               (_U_(0x3) << LCDC_QOSCFG_QOS3CFG_Pos)                /**< (LCDC_QOSCFG) Quality Of Service for 2 to 3 Transition Mask */
#define LCDC_QOSCFG_QOS3CFG(value)            (LCDC_QOSCFG_QOS3CFG_Msk & ((value) << LCDC_QOSCFG_QOS3CFG_Pos))
#define LCDC_QOSCFG_Msk                       _U_(0x00003331)                                      /**< (LCDC_QOSCFG) Register Mask  */


/* -------- LCDC_QOS1M : (LCDC Offset: 0x44) ( R/ 32) LCD Controller QoS 1 Metrics Register -------- */
#define LCDC_QOS1M_MET1_Pos                   _U_(0)                                               /**< (LCDC_QOS1M) Metrics QoS 1 Position */
#define LCDC_QOS1M_MET1_Msk                   (_U_(0xFFFFF) << LCDC_QOS1M_MET1_Pos)                /**< (LCDC_QOS1M) Metrics QoS 1 Mask */
#define LCDC_QOS1M_MET1(value)                (LCDC_QOS1M_MET1_Msk & ((value) << LCDC_QOS1M_MET1_Pos))
#define LCDC_QOS1M_Msk                        _U_(0x000FFFFF)                                      /**< (LCDC_QOS1M) Register Mask  */


/* -------- LCDC_QOS2M : (LCDC Offset: 0x48) ( R/ 32) LCD Controller QoS 2 Metrics Register -------- */
#define LCDC_QOS2M_MET2_Pos                   _U_(0)                                               /**< (LCDC_QOS2M) Metrics QoS 2 Position */
#define LCDC_QOS2M_MET2_Msk                   (_U_(0xFFFFF) << LCDC_QOS2M_MET2_Pos)                /**< (LCDC_QOS2M) Metrics QoS 2 Mask */
#define LCDC_QOS2M_MET2(value)                (LCDC_QOS2M_MET2_Msk & ((value) << LCDC_QOS2M_MET2_Pos))
#define LCDC_QOS2M_Msk                        _U_(0x000FFFFF)                                      /**< (LCDC_QOS2M) Register Mask  */


/* -------- LCDC_QOS3M : (LCDC Offset: 0x4C) ( R/ 32) LCD Controller QoS 3 Metrics Register -------- */
#define LCDC_QOS3M_MET3_Pos                   _U_(0)                                               /**< (LCDC_QOS3M) Metrics QoS 3 Position */
#define LCDC_QOS3M_MET3_Msk                   (_U_(0xFFFFF) << LCDC_QOS3M_MET3_Pos)                /**< (LCDC_QOS3M) Metrics QoS 3 Mask */
#define LCDC_QOS3M_MET3(value)                (LCDC_QOS3M_MET3_Msk & ((value) << LCDC_QOS3M_MET3_Pos))
#define LCDC_QOS3M_Msk                        _U_(0x000FFFFF)                                      /**< (LCDC_QOS3M) Register Mask  */


