Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_QOSMIN : (LCDC Offset: 0x50) ( R/ 32) LCD Controller QoS Min FIFO Level Register -------- */
#define LCDC_QOSMIN_LEVEL_Pos                 _U_(0)                                               /**< (LCDC_QOSMIN) Minimum FIFO Level Position */
#define LCDC_QOSMIN_LEVEL_Msk                 (_U_(0x1FF) << LCDC_QOSMIN_LEVEL_Pos)                /**< (LCDC_QOSMIN) Minimum FIFO Level Mask */
#define LCDC_QOSMIN_LEVEL(value)              (LCDC_QOSMIN_LEVEL_Msk & ((value) << LCDC_QOSMIN_LEVEL_Pos))
#define LCDC_QOSMIN_Msk                       _U_(0x000001FF)                                      /**< (LCDC_QOSMIN) Register Mask  */


/* -------- LCDC_BASECHER : (LCDC Offset: 0x60) ( /W 32) Base Layer Channel Enable Register -------- */
#define LCDC_BASECHER_CHEN_Pos                _U_(0)                                               /**< (LCDC_BASECHER) Channel Enable Position */
#define LCDC_BASECHER_CHEN_Msk                (_U_(0x1) << LCDC_BASECHER_CHEN_Pos)                 /**< (LCDC_BASECHER) Channel Enable Mask */
#define LCDC_BASECHER_CHEN(value)             (LCDC_BASECHER_CHEN_Msk & ((value) << LCDC_BASECHER_CHEN_Pos))
#define LCDC_BASECHER_UPDATEEN_Pos            _U_(1)                                               /**< (LCDC_BASECHER) Update Overlay Attributes Enable Position */
#define LCDC_BASECHER_UPDATEEN_Msk            (_U_(0x1) << LCDC_BASECHER_UPDATEEN_Pos)             /**< (LCDC_BASECHER) Update Overlay Attributes Enable Mask */
#define LCDC_BASECHER_UPDATEEN(value)         (LCDC_BASECHER_UPDATEEN_Msk & ((value) << LCDC_BASECHER_UPDATEEN_Pos))
#define LCDC_BASECHER_A2QEN_Pos               _U_(2)                                               /**< (LCDC_BASECHER) Add To Queue Enable Position */
#define LCDC_BASECHER_A2QEN_Msk               (_U_(0x1) << LCDC_BASECHER_A2QEN_Pos)                /**< (LCDC_BASECHER) Add To Queue Enable Mask */
#define LCDC_BASECHER_A2QEN(value)            (LCDC_BASECHER_A2QEN_Msk & ((value) << LCDC_BASECHER_A2QEN_Pos))
#define LCDC_BASECHER_Msk                     _U_(0x00000007)                                      /**< (LCDC_BASECHER) Register Mask  */


/* -------- LCDC_BASECHDR : (LCDC Offset: 0x64) ( /W 32) Base Layer Channel Disable Register -------- */
#define LCDC_BASECHDR_CHDIS_Pos               _U_(0)                                               /**< (LCDC_BASECHDR) Channel Disable Position */
#define LCDC_BASECHDR_CHDIS_Msk               (_U_(0x1) << LCDC_BASECHDR_CHDIS_Pos)                /**< (LCDC_BASECHDR) Channel Disable Mask */
#define LCDC_BASECHDR_CHDIS(value)            (LCDC_BASECHDR_CHDIS_Msk & ((value) << LCDC_BASECHDR_CHDIS_Pos))
#define LCDC_BASECHDR_CHRST_Pos               _U_(8)                                               /**< (LCDC_BASECHDR) Channel Reset Position */
#define LCDC_BASECHDR_CHRST_Msk               (_U_(0x1) << LCDC_BASECHDR_CHRST_Pos)                /**< (LCDC_BASECHDR) Channel Reset Mask */
#define LCDC_BASECHDR_CHRST(value)            (LCDC_BASECHDR_CHRST_Msk & ((value) << LCDC_BASECHDR_CHRST_Pos))
#define LCDC_BASECHDR_Msk                     _U_(0x00000101)                                      /**< (LCDC_BASECHDR) Register Mask  */


/* -------- LCDC_BASECHSR : (LCDC Offset: 0x68) ( R/ 32) Base Layer Channel Status Register -------- */
#define LCDC_BASECHSR_CHSR_Pos                _U_(0)                                               /**< (LCDC_BASECHSR) Channel Status Position */
#define LCDC_BASECHSR_CHSR_Msk                (_U_(0x1) << LCDC_BASECHSR_CHSR_Pos)                 /**< (LCDC_BASECHSR) Channel Status Mask */
#define LCDC_BASECHSR_CHSR(value)             (LCDC_BASECHSR_CHSR_Msk & ((value) << LCDC_BASECHSR_CHSR_Pos))
#define LCDC_BASECHSR_UPDATESR_Pos            _U_(1)                                               /**< (LCDC_BASECHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_BASECHSR_UPDATESR_Msk            (_U_(0x1) << LCDC_BASECHSR_UPDATESR_Pos)             /**< (LCDC_BASECHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_BASECHSR_UPDATESR(value)         (LCDC_BASECHSR_UPDATESR_Msk & ((value) << LCDC_BASECHSR_UPDATESR_Pos))
#define LCDC_BASECHSR_A2QSR_Pos               _U_(2)                                               /**< (LCDC_BASECHSR) Add To Queue Status Position */
#define LCDC_BASECHSR_A2QSR_Msk               (_U_(0x1) << LCDC_BASECHSR_A2QSR_Pos)                /**< (LCDC_BASECHSR) Add To Queue Status Mask */
#define LCDC_BASECHSR_A2QSR(value)            (LCDC_BASECHSR_A2QSR_Msk & ((value) << LCDC_BASECHSR_A2QSR_Pos))
#define LCDC_BASECHSR_Msk                     _U_(0x00000007)                                      /**< (LCDC_BASECHSR) Register Mask  */


/* -------- LCDC_BASEIER : (LCDC Offset: 0x6C) ( /W 32) Base Layer Interrupt Enable Register -------- */
#define LCDC_BASEIER_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEIER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_BASEIER_DMA_Msk                  (_U_(0x1) << LCDC_BASEIER_DMA_Pos)                   /**< (LCDC_BASEIER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_BASEIER_DMA(value)               (LCDC_BASEIER_DMA_Msk & ((value) << LCDC_BASEIER_DMA_Pos))
#define LCDC_BASEIER_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEIER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_BASEIER_DSCR_Msk                 (_U_(0x1) << LCDC_BASEIER_DSCR_Pos)                  /**< (LCDC_BASEIER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_BASEIER_DSCR(value)              (LCDC_BASEIER_DSCR_Msk & ((value) << LCDC_BASEIER_DSCR_Pos))
#define LCDC_BASEIER_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEIER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_BASEIER_ADD_Msk                  (_U_(0x1) << LCDC_BASEIER_ADD_Pos)                   /**< (LCDC_BASEIER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_BASEIER_ADD(value)               (LCDC_BASEIER_ADD_Msk & ((value) << LCDC_BASEIER_ADD_Pos))
#define LCDC_BASEIER_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEIER) End of List Interrupt Enable Position */
#define LCDC_BASEIER_DONE_Msk                 (_U_(0x1) << LCDC_BASEIER_DONE_Pos)                  /**< (LCDC_BASEIER) End of List Interrupt Enable Mask */
#define LCDC_BASEIER_DONE(value)              (LCDC_BASEIER_DONE_Msk & ((value) << LCDC_BASEIER_DONE_Pos))
#define LCDC_BASEIER_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEIER) Overflow Interrupt Enable Position */
#define LCDC_BASEIER_OVR_Msk                  (_U_(0x1) << LCDC_BASEIER_OVR_Pos)                   /**< (LCDC_BASEIER) Overflow Interrupt Enable Mask */
#define LCDC_BASEIER_OVR(value)               (LCDC_BASEIER_OVR_Msk & ((value) << LCDC_BASEIER_OVR_Pos))
#define LCDC_BASEIER_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEIER) Register Mask  */


/* -------- LCDC_BASEIDR : (LCDC Offset: 0x70) ( /W 32) Base Layer Interrupt Disabled Register -------- */
#define LCDC_BASEIDR_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEIDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_BASEIDR_DMA_Msk                  (_U_(0x1) << LCDC_BASEIDR_DMA_Pos)                   /**< (LCDC_BASEIDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_BASEIDR_DMA(value)               (LCDC_BASEIDR_DMA_Msk & ((value) << LCDC_BASEIDR_DMA_Pos))
#define LCDC_BASEIDR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEIDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_BASEIDR_DSCR_Msk                 (_U_(0x1) << LCDC_BASEIDR_DSCR_Pos)                  /**< (LCDC_BASEIDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_BASEIDR_DSCR(value)              (LCDC_BASEIDR_DSCR_Msk & ((value) << LCDC_BASEIDR_DSCR_Pos))
#define LCDC_BASEIDR_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEIDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_BASEIDR_ADD_Msk                  (_U_(0x1) << LCDC_BASEIDR_ADD_Pos)                   /**< (LCDC_BASEIDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_BASEIDR_ADD(value)               (LCDC_BASEIDR_ADD_Msk & ((value) << LCDC_BASEIDR_ADD_Pos))
#define LCDC_BASEIDR_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEIDR) End of List Interrupt Disable Position */
#define LCDC_BASEIDR_DONE_Msk                 (_U_(0x1) << LCDC_BASEIDR_DONE_Pos)                  /**< (LCDC_BASEIDR) End of List Interrupt Disable Mask */
#define LCDC_BASEIDR_DONE(value)              (LCDC_BASEIDR_DONE_Msk & ((value) << LCDC_BASEIDR_DONE_Pos))
#define LCDC_BASEIDR_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEIDR) Overflow Interrupt Disable Position */
#define LCDC_BASEIDR_OVR_Msk                  (_U_(0x1) << LCDC_BASEIDR_OVR_Pos)                   /**< (LCDC_BASEIDR) Overflow Interrupt Disable Mask */
#define LCDC_BASEIDR_OVR(value)               (LCDC_BASEIDR_OVR_Msk & ((value) << LCDC_BASEIDR_OVR_Pos))
#define LCDC_BASEIDR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEIDR) Register Mask  */


/* -------- LCDC_BASEIMR : (LCDC Offset: 0x74) ( R/ 32) Base Layer Interrupt Mask Register -------- */
#define LCDC_BASEIMR_DMA_Pos                  _U_(2)                                               /**< (LCDC_BASEIMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_BASEIMR_DMA_Msk                  (_U_(0x1) << LCDC_BASEIMR_DMA_Pos)                   /**< (LCDC_BASEIMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_BASEIMR_DMA(value)               (LCDC_BASEIMR_DMA_Msk & ((value) << LCDC_BASEIMR_DMA_Pos))
#define LCDC_BASEIMR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_BASEIMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_BASEIMR_DSCR_Msk                 (_U_(0x1) << LCDC_BASEIMR_DSCR_Pos)                  /**< (LCDC_BASEIMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_BASEIMR_DSCR(value)              (LCDC_BASEIMR_DSCR_Msk & ((value) << LCDC_BASEIMR_DSCR_Pos))
#define LCDC_BASEIMR_ADD_Pos                  _U_(4)                                               /**< (LCDC_BASEIMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_BASEIMR_ADD_Msk                  (_U_(0x1) << LCDC_BASEIMR_ADD_Pos)                   /**< (LCDC_BASEIMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_BASEIMR_ADD(value)               (LCDC_BASEIMR_ADD_Msk & ((value) << LCDC_BASEIMR_ADD_Pos))
#define LCDC_BASEIMR_DONE_Pos                 _U_(5)                                               /**< (LCDC_BASEIMR) End of List Interrupt Mask Position */
#define LCDC_BASEIMR_DONE_Msk                 (_U_(0x1) << LCDC_BASEIMR_DONE_Pos)                  /**< (LCDC_BASEIMR) End of List Interrupt Mask Mask */
#define LCDC_BASEIMR_DONE(value)              (LCDC_BASEIMR_DONE_Msk & ((value) << LCDC_BASEIMR_DONE_Pos))
#define LCDC_BASEIMR_OVR_Pos                  _U_(6)                                               /**< (LCDC_BASEIMR) Overflow Interrupt Mask Position */
#define LCDC_BASEIMR_OVR_Msk                  (_U_(0x1) << LCDC_BASEIMR_OVR_Pos)                   /**< (LCDC_BASEIMR) Overflow Interrupt Mask Mask */
#define LCDC_BASEIMR_OVR(value)               (LCDC_BASEIMR_OVR_Msk & ((value) << LCDC_BASEIMR_OVR_Pos))
#define LCDC_BASEIMR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_BASEIMR) Register Mask  */


