Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_BASECFG4 : (LCDC Offset: 0x9C) (R/W 32) Base Layer Configuration Register 4 -------- */
#define LCDC_BASECFG4_DMA_Pos                 _U_(8)                                               /**< (LCDC_BASECFG4) Use DMA Data Path Position */
#define LCDC_BASECFG4_DMA_Msk                 (_U_(0x1) << LCDC_BASECFG4_DMA_Pos)                  /**< (LCDC_BASECFG4) Use DMA Data Path Mask */
#define LCDC_BASECFG4_DMA(value)              (LCDC_BASECFG4_DMA_Msk & ((value) << LCDC_BASECFG4_DMA_Pos))
#define LCDC_BASECFG4_REP_Pos                 _U_(9)                                               /**< (LCDC_BASECFG4) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_BASECFG4_REP_Msk                 (_U_(0x1) << LCDC_BASECFG4_REP_Pos)                  /**< (LCDC_BASECFG4) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_BASECFG4_REP(value)              (LCDC_BASECFG4_REP_Msk & ((value) << LCDC_BASECFG4_REP_Pos))
#define LCDC_BASECFG4_DISCEN_Pos              _U_(11)                                              /**< (LCDC_BASECFG4) Discard Area Enable Position */
#define LCDC_BASECFG4_DISCEN_Msk              (_U_(0x1) << LCDC_BASECFG4_DISCEN_Pos)               /**< (LCDC_BASECFG4) Discard Area Enable Mask */
#define LCDC_BASECFG4_DISCEN(value)           (LCDC_BASECFG4_DISCEN_Msk & ((value) << LCDC_BASECFG4_DISCEN_Pos))
#define LCDC_BASECFG4_Msk                     _U_(0x00000B00)                                      /**< (LCDC_BASECFG4) Register Mask  */


/* -------- LCDC_BASECFG5 : (LCDC Offset: 0xA0) (R/W 32) Base Layer Configuration Register 5 -------- */
#define LCDC_BASECFG5_DISCXPOS_Pos            _U_(0)                                               /**< (LCDC_BASECFG5) Discard Area Horizontal Coordinate Position */
#define LCDC_BASECFG5_DISCXPOS_Msk            (_U_(0x7FF) << LCDC_BASECFG5_DISCXPOS_Pos)           /**< (LCDC_BASECFG5) Discard Area Horizontal Coordinate Mask */
#define LCDC_BASECFG5_DISCXPOS(value)         (LCDC_BASECFG5_DISCXPOS_Msk & ((value) << LCDC_BASECFG5_DISCXPOS_Pos))
#define LCDC_BASECFG5_DISCYPOS_Pos            _U_(16)                                              /**< (LCDC_BASECFG5) Discard Area Vertical Coordinate Position */
#define LCDC_BASECFG5_DISCYPOS_Msk            (_U_(0x7FF) << LCDC_BASECFG5_DISCYPOS_Pos)           /**< (LCDC_BASECFG5) Discard Area Vertical Coordinate Mask */
#define LCDC_BASECFG5_DISCYPOS(value)         (LCDC_BASECFG5_DISCYPOS_Msk & ((value) << LCDC_BASECFG5_DISCYPOS_Pos))
#define LCDC_BASECFG5_Msk                     _U_(0x07FF07FF)                                      /**< (LCDC_BASECFG5) Register Mask  */


/* -------- LCDC_BASECFG6 : (LCDC Offset: 0xA4) (R/W 32) Base Layer Configuration Register 6 -------- */
#define LCDC_BASECFG6_DISCXSIZE_Pos           _U_(0)                                               /**< (LCDC_BASECFG6) Discard Area Horizontal Size Position */
#define LCDC_BASECFG6_DISCXSIZE_Msk           (_U_(0x7FF) << LCDC_BASECFG6_DISCXSIZE_Pos)          /**< (LCDC_BASECFG6) Discard Area Horizontal Size Mask */
#define LCDC_BASECFG6_DISCXSIZE(value)        (LCDC_BASECFG6_DISCXSIZE_Msk & ((value) << LCDC_BASECFG6_DISCXSIZE_Pos))
#define LCDC_BASECFG6_DISCYSIZE_Pos           _U_(16)                                              /**< (LCDC_BASECFG6) Discard Area Vertical Size Position */
#define LCDC_BASECFG6_DISCYSIZE_Msk           (_U_(0x7FF) << LCDC_BASECFG6_DISCYSIZE_Pos)          /**< (LCDC_BASECFG6) Discard Area Vertical Size Mask */
#define LCDC_BASECFG6_DISCYSIZE(value)        (LCDC_BASECFG6_DISCYSIZE_Msk & ((value) << LCDC_BASECFG6_DISCYSIZE_Pos))
#define LCDC_BASECFG6_Msk                     _U_(0x07FF07FF)                                      /**< (LCDC_BASECFG6) Register Mask  */


/* -------- LCDC_OVR1CHER : (LCDC Offset: 0x160) ( /W 32) Overlay 1 Channel Enable Register -------- */
#define LCDC_OVR1CHER_CHEN_Pos                _U_(0)                                               /**< (LCDC_OVR1CHER) Channel Enable Position */
#define LCDC_OVR1CHER_CHEN_Msk                (_U_(0x1) << LCDC_OVR1CHER_CHEN_Pos)                 /**< (LCDC_OVR1CHER) Channel Enable Mask */
#define LCDC_OVR1CHER_CHEN(value)             (LCDC_OVR1CHER_CHEN_Msk & ((value) << LCDC_OVR1CHER_CHEN_Pos))
#define LCDC_OVR1CHER_UPDATEEN_Pos            _U_(1)                                               /**< (LCDC_OVR1CHER) Update Overlay Attributes Enable Position */
#define LCDC_OVR1CHER_UPDATEEN_Msk            (_U_(0x1) << LCDC_OVR1CHER_UPDATEEN_Pos)             /**< (LCDC_OVR1CHER) Update Overlay Attributes Enable Mask */
#define LCDC_OVR1CHER_UPDATEEN(value)         (LCDC_OVR1CHER_UPDATEEN_Msk & ((value) << LCDC_OVR1CHER_UPDATEEN_Pos))
#define LCDC_OVR1CHER_A2QEN_Pos               _U_(2)                                               /**< (LCDC_OVR1CHER) Add To Queue Enable Position */
#define LCDC_OVR1CHER_A2QEN_Msk               (_U_(0x1) << LCDC_OVR1CHER_A2QEN_Pos)                /**< (LCDC_OVR1CHER) Add To Queue Enable Mask */
#define LCDC_OVR1CHER_A2QEN(value)            (LCDC_OVR1CHER_A2QEN_Msk & ((value) << LCDC_OVR1CHER_A2QEN_Pos))
#define LCDC_OVR1CHER_Msk                     _U_(0x00000007)                                      /**< (LCDC_OVR1CHER) Register Mask  */


/* -------- LCDC_OVR1CHDR : (LCDC Offset: 0x164) ( /W 32) Overlay 1 Channel Disable Register -------- */
#define LCDC_OVR1CHDR_CHDIS_Pos               _U_(0)                                               /**< (LCDC_OVR1CHDR) Channel Disable Position */
#define LCDC_OVR1CHDR_CHDIS_Msk               (_U_(0x1) << LCDC_OVR1CHDR_CHDIS_Pos)                /**< (LCDC_OVR1CHDR) Channel Disable Mask */
#define LCDC_OVR1CHDR_CHDIS(value)            (LCDC_OVR1CHDR_CHDIS_Msk & ((value) << LCDC_OVR1CHDR_CHDIS_Pos))
#define LCDC_OVR1CHDR_CHRST_Pos               _U_(8)                                               /**< (LCDC_OVR1CHDR) Channel Reset Position */
#define LCDC_OVR1CHDR_CHRST_Msk               (_U_(0x1) << LCDC_OVR1CHDR_CHRST_Pos)                /**< (LCDC_OVR1CHDR) Channel Reset Mask */
#define LCDC_OVR1CHDR_CHRST(value)            (LCDC_OVR1CHDR_CHRST_Msk & ((value) << LCDC_OVR1CHDR_CHRST_Pos))
#define LCDC_OVR1CHDR_Msk                     _U_(0x00000101)                                      /**< (LCDC_OVR1CHDR) Register Mask  */


/* -------- LCDC_OVR1CHSR : (LCDC Offset: 0x168) ( R/ 32) Overlay 1 Channel Status Register -------- */
#define LCDC_OVR1CHSR_CHSR_Pos                _U_(0)                                               /**< (LCDC_OVR1CHSR) Channel Status Position */
#define LCDC_OVR1CHSR_CHSR_Msk                (_U_(0x1) << LCDC_OVR1CHSR_CHSR_Pos)                 /**< (LCDC_OVR1CHSR) Channel Status Mask */
#define LCDC_OVR1CHSR_CHSR(value)             (LCDC_OVR1CHSR_CHSR_Msk & ((value) << LCDC_OVR1CHSR_CHSR_Pos))
#define LCDC_OVR1CHSR_UPDATESR_Pos            _U_(1)                                               /**< (LCDC_OVR1CHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_OVR1CHSR_UPDATESR_Msk            (_U_(0x1) << LCDC_OVR1CHSR_UPDATESR_Pos)             /**< (LCDC_OVR1CHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_OVR1CHSR_UPDATESR(value)         (LCDC_OVR1CHSR_UPDATESR_Msk & ((value) << LCDC_OVR1CHSR_UPDATESR_Pos))
#define LCDC_OVR1CHSR_A2QSR_Pos               _U_(2)                                               /**< (LCDC_OVR1CHSR) Add To Queue Status Position */
#define LCDC_OVR1CHSR_A2QSR_Msk               (_U_(0x1) << LCDC_OVR1CHSR_A2QSR_Pos)                /**< (LCDC_OVR1CHSR) Add To Queue Status Mask */
#define LCDC_OVR1CHSR_A2QSR(value)            (LCDC_OVR1CHSR_A2QSR_Msk & ((value) << LCDC_OVR1CHSR_A2QSR_Pos))
#define LCDC_OVR1CHSR_Msk                     _U_(0x00000007)                                      /**< (LCDC_OVR1CHSR) Register Mask  */


/* -------- LCDC_OVR1IER : (LCDC Offset: 0x16C) ( /W 32) Overlay 1 Interrupt Enable Register -------- */
#define LCDC_OVR1IER_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1IER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR1IER_DMA_Msk                  (_U_(0x1) << LCDC_OVR1IER_DMA_Pos)                   /**< (LCDC_OVR1IER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR1IER_DMA(value)               (LCDC_OVR1IER_DMA_Msk & ((value) << LCDC_OVR1IER_DMA_Pos))
#define LCDC_OVR1IER_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1IER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR1IER_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1IER_DSCR_Pos)                  /**< (LCDC_OVR1IER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR1IER_DSCR(value)              (LCDC_OVR1IER_DSCR_Msk & ((value) << LCDC_OVR1IER_DSCR_Pos))
#define LCDC_OVR1IER_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1IER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR1IER_ADD_Msk                  (_U_(0x1) << LCDC_OVR1IER_ADD_Pos)                   /**< (LCDC_OVR1IER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR1IER_ADD(value)               (LCDC_OVR1IER_ADD_Msk & ((value) << LCDC_OVR1IER_ADD_Pos))
#define LCDC_OVR1IER_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1IER) End of List Interrupt Enable Position */
#define LCDC_OVR1IER_DONE_Msk                 (_U_(0x1) << LCDC_OVR1IER_DONE_Pos)                  /**< (LCDC_OVR1IER) End of List Interrupt Enable Mask */
#define LCDC_OVR1IER_DONE(value)              (LCDC_OVR1IER_DONE_Msk & ((value) << LCDC_OVR1IER_DONE_Pos))
#define LCDC_OVR1IER_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1IER) Overflow Interrupt Enable Position */
#define LCDC_OVR1IER_OVR_Msk                  (_U_(0x1) << LCDC_OVR1IER_OVR_Pos)                   /**< (LCDC_OVR1IER) Overflow Interrupt Enable Mask */
#define LCDC_OVR1IER_OVR(value)               (LCDC_OVR1IER_OVR_Msk & ((value) << LCDC_OVR1IER_OVR_Pos))
#define LCDC_OVR1IER_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1IER) Register Mask  */


/* -------- LCDC_OVR1IDR : (LCDC Offset: 0x170) ( /W 32) Overlay 1 Interrupt Disable Register -------- */
#define LCDC_OVR1IDR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1IDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_OVR1IDR_DMA_Msk                  (_U_(0x1) << LCDC_OVR1IDR_DMA_Pos)                   /**< (LCDC_OVR1IDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_OVR1IDR_DMA(value)               (LCDC_OVR1IDR_DMA_Msk & ((value) << LCDC_OVR1IDR_DMA_Pos))
#define LCDC_OVR1IDR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1IDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR1IDR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1IDR_DSCR_Pos)                  /**< (LCDC_OVR1IDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR1IDR_DSCR(value)              (LCDC_OVR1IDR_DSCR_Msk & ((value) << LCDC_OVR1IDR_DSCR_Pos))
#define LCDC_OVR1IDR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1IDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR1IDR_ADD_Msk                  (_U_(0x1) << LCDC_OVR1IDR_ADD_Pos)                   /**< (LCDC_OVR1IDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR1IDR_ADD(value)               (LCDC_OVR1IDR_ADD_Msk & ((value) << LCDC_OVR1IDR_ADD_Pos))
#define LCDC_OVR1IDR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1IDR) End of List Interrupt Disable Position */
#define LCDC_OVR1IDR_DONE_Msk                 (_U_(0x1) << LCDC_OVR1IDR_DONE_Pos)                  /**< (LCDC_OVR1IDR) End of List Interrupt Disable Mask */
#define LCDC_OVR1IDR_DONE(value)              (LCDC_OVR1IDR_DONE_Msk & ((value) << LCDC_OVR1IDR_DONE_Pos))
#define LCDC_OVR1IDR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1IDR) Overflow Interrupt Disable Position */
#define LCDC_OVR1IDR_OVR_Msk                  (_U_(0x1) << LCDC_OVR1IDR_OVR_Pos)                   /**< (LCDC_OVR1IDR) Overflow Interrupt Disable Mask */
#define LCDC_OVR1IDR_OVR(value)               (LCDC_OVR1IDR_OVR_Msk & ((value) << LCDC_OVR1IDR_OVR_Pos))
#define LCDC_OVR1IDR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1IDR) Register Mask  */


