Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_OVR1IMR : (LCDC Offset: 0x174) ( R/ 32) Overlay 1 Interrupt Mask Register -------- */
#define LCDC_OVR1IMR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1IMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_OVR1IMR_DMA_Msk                  (_U_(0x1) << LCDC_OVR1IMR_DMA_Pos)                   /**< (LCDC_OVR1IMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_OVR1IMR_DMA(value)               (LCDC_OVR1IMR_DMA_Msk & ((value) << LCDC_OVR1IMR_DMA_Pos))
#define LCDC_OVR1IMR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1IMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR1IMR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1IMR_DSCR_Pos)                  /**< (LCDC_OVR1IMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR1IMR_DSCR(value)              (LCDC_OVR1IMR_DSCR_Msk & ((value) << LCDC_OVR1IMR_DSCR_Pos))
#define LCDC_OVR1IMR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1IMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR1IMR_ADD_Msk                  (_U_(0x1) << LCDC_OVR1IMR_ADD_Pos)                   /**< (LCDC_OVR1IMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR1IMR_ADD(value)               (LCDC_OVR1IMR_ADD_Msk & ((value) << LCDC_OVR1IMR_ADD_Pos))
#define LCDC_OVR1IMR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1IMR) End of List Interrupt Mask Position */
#define LCDC_OVR1IMR_DONE_Msk                 (_U_(0x1) << LCDC_OVR1IMR_DONE_Pos)                  /**< (LCDC_OVR1IMR) End of List Interrupt Mask Mask */
#define LCDC_OVR1IMR_DONE(value)              (LCDC_OVR1IMR_DONE_Msk & ((value) << LCDC_OVR1IMR_DONE_Pos))
#define LCDC_OVR1IMR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1IMR) Overflow Interrupt Mask Position */
#define LCDC_OVR1IMR_OVR_Msk                  (_U_(0x1) << LCDC_OVR1IMR_OVR_Pos)                   /**< (LCDC_OVR1IMR) Overflow Interrupt Mask Mask */
#define LCDC_OVR1IMR_OVR(value)               (LCDC_OVR1IMR_OVR_Msk & ((value) << LCDC_OVR1IMR_OVR_Pos))
#define LCDC_OVR1IMR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1IMR) Register Mask  */


/* -------- LCDC_OVR1ISR : (LCDC Offset: 0x178) ( R/ 32) Overlay 1 Interrupt Status Register -------- */
#define LCDC_OVR1ISR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR1ISR) End of DMA Transfer Position */
#define LCDC_OVR1ISR_DMA_Msk                  (_U_(0x1) << LCDC_OVR1ISR_DMA_Pos)                   /**< (LCDC_OVR1ISR) End of DMA Transfer Mask */
#define LCDC_OVR1ISR_DMA(value)               (LCDC_OVR1ISR_DMA_Msk & ((value) << LCDC_OVR1ISR_DMA_Pos))
#define LCDC_OVR1ISR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR1ISR) DMA Descriptor Loaded Position */
#define LCDC_OVR1ISR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR1ISR_DSCR_Pos)                  /**< (LCDC_OVR1ISR) DMA Descriptor Loaded Mask */
#define LCDC_OVR1ISR_DSCR(value)              (LCDC_OVR1ISR_DSCR_Msk & ((value) << LCDC_OVR1ISR_DSCR_Pos))
#define LCDC_OVR1ISR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR1ISR) Head Descriptor Loaded Position */
#define LCDC_OVR1ISR_ADD_Msk                  (_U_(0x1) << LCDC_OVR1ISR_ADD_Pos)                   /**< (LCDC_OVR1ISR) Head Descriptor Loaded Mask */
#define LCDC_OVR1ISR_ADD(value)               (LCDC_OVR1ISR_ADD_Msk & ((value) << LCDC_OVR1ISR_ADD_Pos))
#define LCDC_OVR1ISR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR1ISR) End of List Detected Position */
#define LCDC_OVR1ISR_DONE_Msk                 (_U_(0x1) << LCDC_OVR1ISR_DONE_Pos)                  /**< (LCDC_OVR1ISR) End of List Detected Mask */
#define LCDC_OVR1ISR_DONE(value)              (LCDC_OVR1ISR_DONE_Msk & ((value) << LCDC_OVR1ISR_DONE_Pos))
#define LCDC_OVR1ISR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR1ISR) Overflow Detected Position */
#define LCDC_OVR1ISR_OVR_Msk                  (_U_(0x1) << LCDC_OVR1ISR_OVR_Pos)                   /**< (LCDC_OVR1ISR) Overflow Detected Mask */
#define LCDC_OVR1ISR_OVR(value)               (LCDC_OVR1ISR_OVR_Msk & ((value) << LCDC_OVR1ISR_OVR_Pos))
#define LCDC_OVR1ISR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR1ISR) Register Mask  */


/* -------- LCDC_OVR1HEAD : (LCDC Offset: 0x17C) (R/W 32) Overlay 1 DMA Head Register -------- */
#define LCDC_OVR1HEAD_HEAD_Pos                _U_(2)                                               /**< (LCDC_OVR1HEAD) DMA Head Pointer Position */
#define LCDC_OVR1HEAD_HEAD_Msk                (_U_(0x3FFFFFFF) << LCDC_OVR1HEAD_HEAD_Pos)          /**< (LCDC_OVR1HEAD) DMA Head Pointer Mask */
#define LCDC_OVR1HEAD_HEAD(value)             (LCDC_OVR1HEAD_HEAD_Msk & ((value) << LCDC_OVR1HEAD_HEAD_Pos))
#define LCDC_OVR1HEAD_Msk                     _U_(0xFFFFFFFC)                                      /**< (LCDC_OVR1HEAD) Register Mask  */


/* -------- LCDC_OVR1ADDR : (LCDC Offset: 0x180) (R/W 32) Overlay 1 DMA Address Register -------- */
#define LCDC_OVR1ADDR_ADDR_Pos                _U_(0)                                               /**< (LCDC_OVR1ADDR) DMA Transfer Overlay 1 Address Position */
#define LCDC_OVR1ADDR_ADDR_Msk                (_U_(0xFFFFFFFF) << LCDC_OVR1ADDR_ADDR_Pos)          /**< (LCDC_OVR1ADDR) DMA Transfer Overlay 1 Address Mask */
#define LCDC_OVR1ADDR_ADDR(value)             (LCDC_OVR1ADDR_ADDR_Msk & ((value) << LCDC_OVR1ADDR_ADDR_Pos))
#define LCDC_OVR1ADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR1ADDR) Register Mask  */


/* -------- LCDC_OVR1CTRL : (LCDC Offset: 0x184) (R/W 32) Overlay 1 DMA Control Register -------- */
#define LCDC_OVR1CTRL_DFETCH_Pos              _U_(0)                                               /**< (LCDC_OVR1CTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_OVR1CTRL_DFETCH_Msk              (_U_(0x1) << LCDC_OVR1CTRL_DFETCH_Pos)               /**< (LCDC_OVR1CTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_OVR1CTRL_DFETCH(value)           (LCDC_OVR1CTRL_DFETCH_Msk & ((value) << LCDC_OVR1CTRL_DFETCH_Pos))
#define LCDC_OVR1CTRL_LFETCH_Pos              _U_(1)                                               /**< (LCDC_OVR1CTRL) Lookup Table Fetch Enable Position */
#define LCDC_OVR1CTRL_LFETCH_Msk              (_U_(0x1) << LCDC_OVR1CTRL_LFETCH_Pos)               /**< (LCDC_OVR1CTRL) Lookup Table Fetch Enable Mask */
#define LCDC_OVR1CTRL_LFETCH(value)           (LCDC_OVR1CTRL_LFETCH_Msk & ((value) << LCDC_OVR1CTRL_LFETCH_Pos))
#define LCDC_OVR1CTRL_DMAIEN_Pos              _U_(2)                                               /**< (LCDC_OVR1CTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR1CTRL_DMAIEN_Msk              (_U_(0x1) << LCDC_OVR1CTRL_DMAIEN_Pos)               /**< (LCDC_OVR1CTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR1CTRL_DMAIEN(value)           (LCDC_OVR1CTRL_DMAIEN_Msk & ((value) << LCDC_OVR1CTRL_DMAIEN_Pos))
#define LCDC_OVR1CTRL_DSCRIEN_Pos             _U_(3)                                               /**< (LCDC_OVR1CTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR1CTRL_DSCRIEN_Msk             (_U_(0x1) << LCDC_OVR1CTRL_DSCRIEN_Pos)              /**< (LCDC_OVR1CTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR1CTRL_DSCRIEN(value)          (LCDC_OVR1CTRL_DSCRIEN_Msk & ((value) << LCDC_OVR1CTRL_DSCRIEN_Pos))
#define LCDC_OVR1CTRL_ADDIEN_Pos              _U_(4)                                               /**< (LCDC_OVR1CTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_OVR1CTRL_ADDIEN_Msk              (_U_(0x1) << LCDC_OVR1CTRL_ADDIEN_Pos)               /**< (LCDC_OVR1CTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_OVR1CTRL_ADDIEN(value)           (LCDC_OVR1CTRL_ADDIEN_Msk & ((value) << LCDC_OVR1CTRL_ADDIEN_Pos))
#define LCDC_OVR1CTRL_DONEIEN_Pos             _U_(5)                                               /**< (LCDC_OVR1CTRL) End of List Interrupt Enable Position */
#define LCDC_OVR1CTRL_DONEIEN_Msk             (_U_(0x1) << LCDC_OVR1CTRL_DONEIEN_Pos)              /**< (LCDC_OVR1CTRL) End of List Interrupt Enable Mask */
#define LCDC_OVR1CTRL_DONEIEN(value)          (LCDC_OVR1CTRL_DONEIEN_Msk & ((value) << LCDC_OVR1CTRL_DONEIEN_Pos))
#define LCDC_OVR1CTRL_Msk                     _U_(0x0000003F)                                      /**< (LCDC_OVR1CTRL) Register Mask  */


/* -------- LCDC_OVR1NEXT : (LCDC Offset: 0x188) (R/W 32) Overlay 1 DMA Next Register -------- */
#define LCDC_OVR1NEXT_NEXT_Pos                _U_(0)                                               /**< (LCDC_OVR1NEXT) DMA Descriptor Next Address Position */
#define LCDC_OVR1NEXT_NEXT_Msk                (_U_(0xFFFFFFFF) << LCDC_OVR1NEXT_NEXT_Pos)          /**< (LCDC_OVR1NEXT) DMA Descriptor Next Address Mask */
#define LCDC_OVR1NEXT_NEXT(value)             (LCDC_OVR1NEXT_NEXT_Msk & ((value) << LCDC_OVR1NEXT_NEXT_Pos))
#define LCDC_OVR1NEXT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR1NEXT) Register Mask  */


