Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_OVR2IER : (LCDC Offset: 0x26C) ( /W 32) Overlay 2 Interrupt Enable Register -------- */
#define LCDC_OVR2IER_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR2IER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR2IER_DMA_Msk                  (_U_(0x1) << LCDC_OVR2IER_DMA_Pos)                   /**< (LCDC_OVR2IER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR2IER_DMA(value)               (LCDC_OVR2IER_DMA_Msk & ((value) << LCDC_OVR2IER_DMA_Pos))
#define LCDC_OVR2IER_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR2IER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR2IER_DSCR_Msk                 (_U_(0x1) << LCDC_OVR2IER_DSCR_Pos)                  /**< (LCDC_OVR2IER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR2IER_DSCR(value)              (LCDC_OVR2IER_DSCR_Msk & ((value) << LCDC_OVR2IER_DSCR_Pos))
#define LCDC_OVR2IER_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR2IER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR2IER_ADD_Msk                  (_U_(0x1) << LCDC_OVR2IER_ADD_Pos)                   /**< (LCDC_OVR2IER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR2IER_ADD(value)               (LCDC_OVR2IER_ADD_Msk & ((value) << LCDC_OVR2IER_ADD_Pos))
#define LCDC_OVR2IER_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR2IER) End of List Interrupt Enable Position */
#define LCDC_OVR2IER_DONE_Msk                 (_U_(0x1) << LCDC_OVR2IER_DONE_Pos)                  /**< (LCDC_OVR2IER) End of List Interrupt Enable Mask */
#define LCDC_OVR2IER_DONE(value)              (LCDC_OVR2IER_DONE_Msk & ((value) << LCDC_OVR2IER_DONE_Pos))
#define LCDC_OVR2IER_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR2IER) Overflow Interrupt Enable Position */
#define LCDC_OVR2IER_OVR_Msk                  (_U_(0x1) << LCDC_OVR2IER_OVR_Pos)                   /**< (LCDC_OVR2IER) Overflow Interrupt Enable Mask */
#define LCDC_OVR2IER_OVR(value)               (LCDC_OVR2IER_OVR_Msk & ((value) << LCDC_OVR2IER_OVR_Pos))
#define LCDC_OVR2IER_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR2IER) Register Mask  */


/* -------- LCDC_OVR2IDR : (LCDC Offset: 0x270) ( /W 32) Overlay 2 Interrupt Disable Register -------- */
#define LCDC_OVR2IDR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR2IDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_OVR2IDR_DMA_Msk                  (_U_(0x1) << LCDC_OVR2IDR_DMA_Pos)                   /**< (LCDC_OVR2IDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_OVR2IDR_DMA(value)               (LCDC_OVR2IDR_DMA_Msk & ((value) << LCDC_OVR2IDR_DMA_Pos))
#define LCDC_OVR2IDR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR2IDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR2IDR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR2IDR_DSCR_Pos)                  /**< (LCDC_OVR2IDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR2IDR_DSCR(value)              (LCDC_OVR2IDR_DSCR_Msk & ((value) << LCDC_OVR2IDR_DSCR_Pos))
#define LCDC_OVR2IDR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR2IDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR2IDR_ADD_Msk                  (_U_(0x1) << LCDC_OVR2IDR_ADD_Pos)                   /**< (LCDC_OVR2IDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR2IDR_ADD(value)               (LCDC_OVR2IDR_ADD_Msk & ((value) << LCDC_OVR2IDR_ADD_Pos))
#define LCDC_OVR2IDR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR2IDR) End of List Interrupt Disable Position */
#define LCDC_OVR2IDR_DONE_Msk                 (_U_(0x1) << LCDC_OVR2IDR_DONE_Pos)                  /**< (LCDC_OVR2IDR) End of List Interrupt Disable Mask */
#define LCDC_OVR2IDR_DONE(value)              (LCDC_OVR2IDR_DONE_Msk & ((value) << LCDC_OVR2IDR_DONE_Pos))
#define LCDC_OVR2IDR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR2IDR) Overflow Interrupt Disable Position */
#define LCDC_OVR2IDR_OVR_Msk                  (_U_(0x1) << LCDC_OVR2IDR_OVR_Pos)                   /**< (LCDC_OVR2IDR) Overflow Interrupt Disable Mask */
#define LCDC_OVR2IDR_OVR(value)               (LCDC_OVR2IDR_OVR_Msk & ((value) << LCDC_OVR2IDR_OVR_Pos))
#define LCDC_OVR2IDR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR2IDR) Register Mask  */


/* -------- LCDC_OVR2IMR : (LCDC Offset: 0x274) ( R/ 32) Overlay 2 Interrupt Mask Register -------- */
#define LCDC_OVR2IMR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR2IMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_OVR2IMR_DMA_Msk                  (_U_(0x1) << LCDC_OVR2IMR_DMA_Pos)                   /**< (LCDC_OVR2IMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_OVR2IMR_DMA(value)               (LCDC_OVR2IMR_DMA_Msk & ((value) << LCDC_OVR2IMR_DMA_Pos))
#define LCDC_OVR2IMR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR2IMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR2IMR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR2IMR_DSCR_Pos)                  /**< (LCDC_OVR2IMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR2IMR_DSCR(value)              (LCDC_OVR2IMR_DSCR_Msk & ((value) << LCDC_OVR2IMR_DSCR_Pos))
#define LCDC_OVR2IMR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR2IMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR2IMR_ADD_Msk                  (_U_(0x1) << LCDC_OVR2IMR_ADD_Pos)                   /**< (LCDC_OVR2IMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR2IMR_ADD(value)               (LCDC_OVR2IMR_ADD_Msk & ((value) << LCDC_OVR2IMR_ADD_Pos))
#define LCDC_OVR2IMR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR2IMR) End of List Interrupt Mask Position */
#define LCDC_OVR2IMR_DONE_Msk                 (_U_(0x1) << LCDC_OVR2IMR_DONE_Pos)                  /**< (LCDC_OVR2IMR) End of List Interrupt Mask Mask */
#define LCDC_OVR2IMR_DONE(value)              (LCDC_OVR2IMR_DONE_Msk & ((value) << LCDC_OVR2IMR_DONE_Pos))
#define LCDC_OVR2IMR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR2IMR) Overflow Interrupt Mask Position */
#define LCDC_OVR2IMR_OVR_Msk                  (_U_(0x1) << LCDC_OVR2IMR_OVR_Pos)                   /**< (LCDC_OVR2IMR) Overflow Interrupt Mask Mask */
#define LCDC_OVR2IMR_OVR(value)               (LCDC_OVR2IMR_OVR_Msk & ((value) << LCDC_OVR2IMR_OVR_Pos))
#define LCDC_OVR2IMR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR2IMR) Register Mask  */


/* -------- LCDC_OVR2ISR : (LCDC Offset: 0x278) ( R/ 32) Overlay 2 Interrupt Status Register -------- */
#define LCDC_OVR2ISR_DMA_Pos                  _U_(2)                                               /**< (LCDC_OVR2ISR) End of DMA Transfer Position */
#define LCDC_OVR2ISR_DMA_Msk                  (_U_(0x1) << LCDC_OVR2ISR_DMA_Pos)                   /**< (LCDC_OVR2ISR) End of DMA Transfer Mask */
#define LCDC_OVR2ISR_DMA(value)               (LCDC_OVR2ISR_DMA_Msk & ((value) << LCDC_OVR2ISR_DMA_Pos))
#define LCDC_OVR2ISR_DSCR_Pos                 _U_(3)                                               /**< (LCDC_OVR2ISR) DMA Descriptor Loaded Position */
#define LCDC_OVR2ISR_DSCR_Msk                 (_U_(0x1) << LCDC_OVR2ISR_DSCR_Pos)                  /**< (LCDC_OVR2ISR) DMA Descriptor Loaded Mask */
#define LCDC_OVR2ISR_DSCR(value)              (LCDC_OVR2ISR_DSCR_Msk & ((value) << LCDC_OVR2ISR_DSCR_Pos))
#define LCDC_OVR2ISR_ADD_Pos                  _U_(4)                                               /**< (LCDC_OVR2ISR) Head Descriptor Loaded Position */
#define LCDC_OVR2ISR_ADD_Msk                  (_U_(0x1) << LCDC_OVR2ISR_ADD_Pos)                   /**< (LCDC_OVR2ISR) Head Descriptor Loaded Mask */
#define LCDC_OVR2ISR_ADD(value)               (LCDC_OVR2ISR_ADD_Msk & ((value) << LCDC_OVR2ISR_ADD_Pos))
#define LCDC_OVR2ISR_DONE_Pos                 _U_(5)                                               /**< (LCDC_OVR2ISR) End of List Detected Position */
#define LCDC_OVR2ISR_DONE_Msk                 (_U_(0x1) << LCDC_OVR2ISR_DONE_Pos)                  /**< (LCDC_OVR2ISR) End of List Detected Mask */
#define LCDC_OVR2ISR_DONE(value)              (LCDC_OVR2ISR_DONE_Msk & ((value) << LCDC_OVR2ISR_DONE_Pos))
#define LCDC_OVR2ISR_OVR_Pos                  _U_(6)                                               /**< (LCDC_OVR2ISR) Overflow Detected Position */
#define LCDC_OVR2ISR_OVR_Msk                  (_U_(0x1) << LCDC_OVR2ISR_OVR_Pos)                   /**< (LCDC_OVR2ISR) Overflow Detected Mask */
#define LCDC_OVR2ISR_OVR(value)               (LCDC_OVR2ISR_OVR_Msk & ((value) << LCDC_OVR2ISR_OVR_Pos))
#define LCDC_OVR2ISR_Msk                      _U_(0x0000007C)                                      /**< (LCDC_OVR2ISR) Register Mask  */


/* -------- LCDC_OVR2HEAD : (LCDC Offset: 0x27C) (R/W 32) Overlay 2 DMA Head Register -------- */
#define LCDC_OVR2HEAD_HEAD_Pos                _U_(2)                                               /**< (LCDC_OVR2HEAD) DMA Head Pointer Position */
#define LCDC_OVR2HEAD_HEAD_Msk                (_U_(0x3FFFFFFF) << LCDC_OVR2HEAD_HEAD_Pos)          /**< (LCDC_OVR2HEAD) DMA Head Pointer Mask */
#define LCDC_OVR2HEAD_HEAD(value)             (LCDC_OVR2HEAD_HEAD_Msk & ((value) << LCDC_OVR2HEAD_HEAD_Pos))
#define LCDC_OVR2HEAD_Msk                     _U_(0xFFFFFFFC)                                      /**< (LCDC_OVR2HEAD) Register Mask  */


/* -------- LCDC_OVR2ADDR : (LCDC Offset: 0x280) (R/W 32) Overlay 2 DMA Address Register -------- */
#define LCDC_OVR2ADDR_ADDR_Pos                _U_(0)                                               /**< (LCDC_OVR2ADDR) DMA Transfer Overlay 2 Address Position */
#define LCDC_OVR2ADDR_ADDR_Msk                (_U_(0xFFFFFFFF) << LCDC_OVR2ADDR_ADDR_Pos)          /**< (LCDC_OVR2ADDR) DMA Transfer Overlay 2 Address Mask */
#define LCDC_OVR2ADDR_ADDR(value)             (LCDC_OVR2ADDR_ADDR_Msk & ((value) << LCDC_OVR2ADDR_ADDR_Pos))
#define LCDC_OVR2ADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR2ADDR) Register Mask  */


/* -------- LCDC_OVR2CTRL : (LCDC Offset: 0x284) (R/W 32) Overlay 2 DMA Control Register -------- */
#define LCDC_OVR2CTRL_DFETCH_Pos              _U_(0)                                               /**< (LCDC_OVR2CTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_OVR2CTRL_DFETCH_Msk              (_U_(0x1) << LCDC_OVR2CTRL_DFETCH_Pos)               /**< (LCDC_OVR2CTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_OVR2CTRL_DFETCH(value)           (LCDC_OVR2CTRL_DFETCH_Msk & ((value) << LCDC_OVR2CTRL_DFETCH_Pos))
#define LCDC_OVR2CTRL_LFETCH_Pos              _U_(1)                                               /**< (LCDC_OVR2CTRL) Lookup Table Fetch Enable Position */
#define LCDC_OVR2CTRL_LFETCH_Msk              (_U_(0x1) << LCDC_OVR2CTRL_LFETCH_Pos)               /**< (LCDC_OVR2CTRL) Lookup Table Fetch Enable Mask */
#define LCDC_OVR2CTRL_LFETCH(value)           (LCDC_OVR2CTRL_LFETCH_Msk & ((value) << LCDC_OVR2CTRL_LFETCH_Pos))
#define LCDC_OVR2CTRL_DMAIEN_Pos              _U_(2)                                               /**< (LCDC_OVR2CTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR2CTRL_DMAIEN_Msk              (_U_(0x1) << LCDC_OVR2CTRL_DMAIEN_Pos)               /**< (LCDC_OVR2CTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR2CTRL_DMAIEN(value)           (LCDC_OVR2CTRL_DMAIEN_Msk & ((value) << LCDC_OVR2CTRL_DMAIEN_Pos))
#define LCDC_OVR2CTRL_DSCRIEN_Pos             _U_(3)                                               /**< (LCDC_OVR2CTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR2CTRL_DSCRIEN_Msk             (_U_(0x1) << LCDC_OVR2CTRL_DSCRIEN_Pos)              /**< (LCDC_OVR2CTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR2CTRL_DSCRIEN(value)          (LCDC_OVR2CTRL_DSCRIEN_Msk & ((value) << LCDC_OVR2CTRL_DSCRIEN_Pos))
#define LCDC_OVR2CTRL_ADDIEN_Pos              _U_(4)                                               /**< (LCDC_OVR2CTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_OVR2CTRL_ADDIEN_Msk              (_U_(0x1) << LCDC_OVR2CTRL_ADDIEN_Pos)               /**< (LCDC_OVR2CTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_OVR2CTRL_ADDIEN(value)           (LCDC_OVR2CTRL_ADDIEN_Msk & ((value) << LCDC_OVR2CTRL_ADDIEN_Pos))
#define LCDC_OVR2CTRL_DONEIEN_Pos             _U_(5)                                               /**< (LCDC_OVR2CTRL) End of List Interrupt Enable Position */
#define LCDC_OVR2CTRL_DONEIEN_Msk             (_U_(0x1) << LCDC_OVR2CTRL_DONEIEN_Pos)              /**< (LCDC_OVR2CTRL) End of List Interrupt Enable Mask */
#define LCDC_OVR2CTRL_DONEIEN(value)          (LCDC_OVR2CTRL_DONEIEN_Msk & ((value) << LCDC_OVR2CTRL_DONEIEN_Pos))
#define LCDC_OVR2CTRL_Msk                     _U_(0x0000003F)                                      /**< (LCDC_OVR2CTRL) Register Mask  */


/* -------- LCDC_OVR2NEXT : (LCDC Offset: 0x288) (R/W 32) Overlay 2 DMA Next Register -------- */
#define LCDC_OVR2NEXT_NEXT_Pos                _U_(0)                                               /**< (LCDC_OVR2NEXT) DMA Descriptor Next Address Position */
#define LCDC_OVR2NEXT_NEXT_Msk                (_U_(0xFFFFFFFF) << LCDC_OVR2NEXT_NEXT_Pos)          /**< (LCDC_OVR2NEXT) DMA Descriptor Next Address Mask */
#define LCDC_OVR2NEXT_NEXT(value)             (LCDC_OVR2NEXT_NEXT_Msk & ((value) << LCDC_OVR2NEXT_NEXT_Pos))
#define LCDC_OVR2NEXT_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_OVR2NEXT) Register Mask  */


/* -------- LCDC_OVR2CFG0 : (LCDC Offset: 0x28C) (R/W 32) Overlay 2 Configuration Register 0 -------- */
#define LCDC_OVR2CFG0_BLEN_Pos                _U_(4)                                               /**< (LCDC_OVR2CFG0) AHB Burst Length Position */
#define LCDC_OVR2CFG0_BLEN_Msk                (_U_(0x3) << LCDC_OVR2CFG0_BLEN_Pos)                 /**< (LCDC_OVR2CFG0) AHB Burst Length Mask */
#define LCDC_OVR2CFG0_BLEN(value)             (LCDC_OVR2CFG0_BLEN_Msk & ((value) << LCDC_OVR2CFG0_BLEN_Pos))
#define   LCDC_OVR2CFG0_BLEN_AHB_SINGLE_Val   _U_(0x0)                                             /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_OVR2CFG0_BLEN_AHB_INCR4_Val    _U_(0x1)                                             /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_OVR2CFG0_BLEN_AHB_INCR8_Val    _U_(0x2)                                             /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_OVR2CFG0_BLEN_AHB_INCR16_Val   _U_(0x3)                                             /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define LCDC_OVR2CFG0_BLEN_AHB_SINGLE         (LCDC_OVR2CFG0_BLEN_AHB_SINGLE_Val << LCDC_OVR2CFG0_BLEN_Pos) /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_BLEN_AHB_INCR4          (LCDC_OVR2CFG0_BLEN_AHB_INCR4_Val << LCDC_OVR2CFG0_BLEN_Pos) /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_BLEN_AHB_INCR8          (LCDC_OVR2CFG0_BLEN_AHB_INCR8_Val << LCDC_OVR2CFG0_BLEN_Pos) /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_BLEN_AHB_INCR16         (LCDC_OVR2CFG0_BLEN_AHB_INCR16_Val << LCDC_OVR2CFG0_BLEN_Pos) /**< (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_DLBO_Pos                _U_(8)                                               /**< (LCDC_OVR2CFG0) Defined Length Burst Only For Channel Bus Transaction Position */
#define LCDC_OVR2CFG0_DLBO_Msk                (_U_(0x1) << LCDC_OVR2CFG0_DLBO_Pos)                 /**< (LCDC_OVR2CFG0) Defined Length Burst Only For Channel Bus Transaction Mask */
#define LCDC_OVR2CFG0_DLBO(value)             (LCDC_OVR2CFG0_DLBO_Msk & ((value) << LCDC_OVR2CFG0_DLBO_Pos))
#define LCDC_OVR2CFG0_ROTDIS_Pos              _U_(12)                                              /**< (LCDC_OVR2CFG0) Hardware Rotation Optimization Disable Position */
#define LCDC_OVR2CFG0_ROTDIS_Msk              (_U_(0x1) << LCDC_OVR2CFG0_ROTDIS_Pos)               /**< (LCDC_OVR2CFG0) Hardware Rotation Optimization Disable Mask */
#define LCDC_OVR2CFG0_ROTDIS(value)           (LCDC_OVR2CFG0_ROTDIS_Msk & ((value) << LCDC_OVR2CFG0_ROTDIS_Pos))
#define LCDC_OVR2CFG0_LOCKDIS_Pos             _U_(13)                                              /**< (LCDC_OVR2CFG0) Hardware Rotation Lock Disable Position */
#define LCDC_OVR2CFG0_LOCKDIS_Msk             (_U_(0x1) << LCDC_OVR2CFG0_LOCKDIS_Pos)              /**< (LCDC_OVR2CFG0) Hardware Rotation Lock Disable Mask */
#define LCDC_OVR2CFG0_LOCKDIS(value)          (LCDC_OVR2CFG0_LOCKDIS_Msk & ((value) << LCDC_OVR2CFG0_LOCKDIS_Pos))
#define LCDC_OVR2CFG0_Msk                     _U_(0x00003130)                                      /**< (LCDC_OVR2CFG0) Register Mask  */


