Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_HEOIDR : (LCDC Offset: 0x370) ( /W 32) High-End Overlay Interrupt Disable Register -------- */
#define LCDC_HEOIDR_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOIDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_HEOIDR_DMA_Msk                   (_U_(0x1) << LCDC_HEOIDR_DMA_Pos)                    /**< (LCDC_HEOIDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_HEOIDR_DMA(value)                (LCDC_HEOIDR_DMA_Msk & ((value) << LCDC_HEOIDR_DMA_Pos))
#define LCDC_HEOIDR_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOIDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_HEOIDR_DSCR_Msk                  (_U_(0x1) << LCDC_HEOIDR_DSCR_Pos)                   /**< (LCDC_HEOIDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_HEOIDR_DSCR(value)               (LCDC_HEOIDR_DSCR_Msk & ((value) << LCDC_HEOIDR_DSCR_Pos))
#define LCDC_HEOIDR_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOIDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_HEOIDR_ADD_Msk                   (_U_(0x1) << LCDC_HEOIDR_ADD_Pos)                    /**< (LCDC_HEOIDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_HEOIDR_ADD(value)                (LCDC_HEOIDR_ADD_Msk & ((value) << LCDC_HEOIDR_ADD_Pos))
#define LCDC_HEOIDR_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOIDR) End of List Interrupt Disable Position */
#define LCDC_HEOIDR_DONE_Msk                  (_U_(0x1) << LCDC_HEOIDR_DONE_Pos)                   /**< (LCDC_HEOIDR) End of List Interrupt Disable Mask */
#define LCDC_HEOIDR_DONE(value)               (LCDC_HEOIDR_DONE_Msk & ((value) << LCDC_HEOIDR_DONE_Pos))
#define LCDC_HEOIDR_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOIDR) Overflow Interrupt Disable Position */
#define LCDC_HEOIDR_OVR_Msk                   (_U_(0x1) << LCDC_HEOIDR_OVR_Pos)                    /**< (LCDC_HEOIDR) Overflow Interrupt Disable Mask */
#define LCDC_HEOIDR_OVR(value)                (LCDC_HEOIDR_OVR_Msk & ((value) << LCDC_HEOIDR_OVR_Pos))
#define LCDC_HEOIDR_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOIDR) End of DMA Transfer for U or UV Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_UDMA_Msk                  (_U_(0x1) << LCDC_HEOIDR_UDMA_Pos)                   /**< (LCDC_HEOIDR) End of DMA Transfer for U or UV Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_UDMA(value)               (LCDC_HEOIDR_UDMA_Msk & ((value) << LCDC_HEOIDR_UDMA_Pos))
#define LCDC_HEOIDR_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOIDR) Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOIDR_UDSCR_Pos)                  /**< (LCDC_HEOIDR) Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_UDSCR(value)              (LCDC_HEOIDR_UDSCR_Msk & ((value) << LCDC_HEOIDR_UDSCR_Pos))
#define LCDC_HEOIDR_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOIDR) Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_UADD_Msk                  (_U_(0x1) << LCDC_HEOIDR_UADD_Pos)                   /**< (LCDC_HEOIDR) Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_UADD(value)               (LCDC_HEOIDR_UADD_Msk & ((value) << LCDC_HEOIDR_UADD_Pos))
#define LCDC_HEOIDR_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOIDR) End of List Interrupt for U or UV Chrominance Component Disable Position */
#define LCDC_HEOIDR_UDONE_Msk                 (_U_(0x1) << LCDC_HEOIDR_UDONE_Pos)                  /**< (LCDC_HEOIDR) End of List Interrupt for U or UV Chrominance Component Disable Mask */
#define LCDC_HEOIDR_UDONE(value)              (LCDC_HEOIDR_UDONE_Msk & ((value) << LCDC_HEOIDR_UDONE_Pos))
#define LCDC_HEOIDR_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOIDR) Overflow Interrupt for U or UV Chrominance Component Disable Position */
#define LCDC_HEOIDR_UOVR_Msk                  (_U_(0x1) << LCDC_HEOIDR_UOVR_Pos)                   /**< (LCDC_HEOIDR) Overflow Interrupt for U or UV Chrominance Component Disable Mask */
#define LCDC_HEOIDR_UOVR(value)               (LCDC_HEOIDR_UOVR_Msk & ((value) << LCDC_HEOIDR_UOVR_Pos))
#define LCDC_HEOIDR_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOIDR) End of DMA Transfer for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VDMA_Msk                  (_U_(0x1) << LCDC_HEOIDR_VDMA_Pos)                   /**< (LCDC_HEOIDR) End of DMA Transfer for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VDMA(value)               (LCDC_HEOIDR_VDMA_Msk & ((value) << LCDC_HEOIDR_VDMA_Pos))
#define LCDC_HEOIDR_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOIDR) Descriptor Loaded for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOIDR_VDSCR_Pos)                  /**< (LCDC_HEOIDR) Descriptor Loaded for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VDSCR(value)              (LCDC_HEOIDR_VDSCR_Msk & ((value) << LCDC_HEOIDR_VDSCR_Pos))
#define LCDC_HEOIDR_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOIDR) Head Descriptor Loaded for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VADD_Msk                  (_U_(0x1) << LCDC_HEOIDR_VADD_Pos)                   /**< (LCDC_HEOIDR) Head Descriptor Loaded for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VADD(value)               (LCDC_HEOIDR_VADD_Msk & ((value) << LCDC_HEOIDR_VADD_Pos))
#define LCDC_HEOIDR_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOIDR) End of List for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VDONE_Msk                 (_U_(0x1) << LCDC_HEOIDR_VDONE_Pos)                  /**< (LCDC_HEOIDR) End of List for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VDONE(value)              (LCDC_HEOIDR_VDONE_Msk & ((value) << LCDC_HEOIDR_VDONE_Pos))
#define LCDC_HEOIDR_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOIDR) Overflow for V Chrominance Component Interrupt Disable Position */
#define LCDC_HEOIDR_VOVR_Msk                  (_U_(0x1) << LCDC_HEOIDR_VOVR_Pos)                   /**< (LCDC_HEOIDR) Overflow for V Chrominance Component Interrupt Disable Mask */
#define LCDC_HEOIDR_VOVR(value)               (LCDC_HEOIDR_VOVR_Msk & ((value) << LCDC_HEOIDR_VOVR_Pos))
#define LCDC_HEOIDR_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOIDR) Register Mask  */


/* -------- LCDC_HEOIMR : (LCDC Offset: 0x374) ( R/ 32) High-End Overlay Interrupt Mask Register -------- */
#define LCDC_HEOIMR_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOIMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_HEOIMR_DMA_Msk                   (_U_(0x1) << LCDC_HEOIMR_DMA_Pos)                    /**< (LCDC_HEOIMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_HEOIMR_DMA(value)                (LCDC_HEOIMR_DMA_Msk & ((value) << LCDC_HEOIMR_DMA_Pos))
#define LCDC_HEOIMR_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOIMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_HEOIMR_DSCR_Msk                  (_U_(0x1) << LCDC_HEOIMR_DSCR_Pos)                   /**< (LCDC_HEOIMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_HEOIMR_DSCR(value)               (LCDC_HEOIMR_DSCR_Msk & ((value) << LCDC_HEOIMR_DSCR_Pos))
#define LCDC_HEOIMR_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOIMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_HEOIMR_ADD_Msk                   (_U_(0x1) << LCDC_HEOIMR_ADD_Pos)                    /**< (LCDC_HEOIMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_HEOIMR_ADD(value)                (LCDC_HEOIMR_ADD_Msk & ((value) << LCDC_HEOIMR_ADD_Pos))
#define LCDC_HEOIMR_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOIMR) End of List Interrupt Mask Position */
#define LCDC_HEOIMR_DONE_Msk                  (_U_(0x1) << LCDC_HEOIMR_DONE_Pos)                   /**< (LCDC_HEOIMR) End of List Interrupt Mask Mask */
#define LCDC_HEOIMR_DONE(value)               (LCDC_HEOIMR_DONE_Msk & ((value) << LCDC_HEOIMR_DONE_Pos))
#define LCDC_HEOIMR_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOIMR) Overflow Interrupt Mask Position */
#define LCDC_HEOIMR_OVR_Msk                   (_U_(0x1) << LCDC_HEOIMR_OVR_Pos)                    /**< (LCDC_HEOIMR) Overflow Interrupt Mask Mask */
#define LCDC_HEOIMR_OVR(value)                (LCDC_HEOIMR_OVR_Msk & ((value) << LCDC_HEOIMR_OVR_Pos))
#define LCDC_HEOIMR_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOIMR) End of DMA Transfer for U or UV Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_UDMA_Msk                  (_U_(0x1) << LCDC_HEOIMR_UDMA_Pos)                   /**< (LCDC_HEOIMR) End of DMA Transfer for U or UV Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_UDMA(value)               (LCDC_HEOIMR_UDMA_Msk & ((value) << LCDC_HEOIMR_UDMA_Pos))
#define LCDC_HEOIMR_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOIMR) Descriptor Loaded for U or UV Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOIMR_UDSCR_Pos)                  /**< (LCDC_HEOIMR) Descriptor Loaded for U or UV Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_UDSCR(value)              (LCDC_HEOIMR_UDSCR_Msk & ((value) << LCDC_HEOIMR_UDSCR_Pos))
#define LCDC_HEOIMR_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOIMR) Head Descriptor Loaded for U or UV Chrominance Component Mask Position */
#define LCDC_HEOIMR_UADD_Msk                  (_U_(0x1) << LCDC_HEOIMR_UADD_Pos)                   /**< (LCDC_HEOIMR) Head Descriptor Loaded for U or UV Chrominance Component Mask Mask */
#define LCDC_HEOIMR_UADD(value)               (LCDC_HEOIMR_UADD_Msk & ((value) << LCDC_HEOIMR_UADD_Pos))
#define LCDC_HEOIMR_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOIMR) End of List for U or UV Chrominance Component Mask Position */
#define LCDC_HEOIMR_UDONE_Msk                 (_U_(0x1) << LCDC_HEOIMR_UDONE_Pos)                  /**< (LCDC_HEOIMR) End of List for U or UV Chrominance Component Mask Mask */
#define LCDC_HEOIMR_UDONE(value)              (LCDC_HEOIMR_UDONE_Msk & ((value) << LCDC_HEOIMR_UDONE_Pos))
#define LCDC_HEOIMR_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOIMR) Overflow for U Chrominance Interrupt Mask Position */
#define LCDC_HEOIMR_UOVR_Msk                  (_U_(0x1) << LCDC_HEOIMR_UOVR_Pos)                   /**< (LCDC_HEOIMR) Overflow for U Chrominance Interrupt Mask Mask */
#define LCDC_HEOIMR_UOVR(value)               (LCDC_HEOIMR_UOVR_Msk & ((value) << LCDC_HEOIMR_UOVR_Pos))
#define LCDC_HEOIMR_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOIMR) End of DMA Transfer for V Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_VDMA_Msk                  (_U_(0x1) << LCDC_HEOIMR_VDMA_Pos)                   /**< (LCDC_HEOIMR) End of DMA Transfer for V Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_VDMA(value)               (LCDC_HEOIMR_VDMA_Msk & ((value) << LCDC_HEOIMR_VDMA_Pos))
#define LCDC_HEOIMR_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOIMR) Descriptor Loaded for V Chrominance Component Interrupt Mask Position */
#define LCDC_HEOIMR_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOIMR_VDSCR_Pos)                  /**< (LCDC_HEOIMR) Descriptor Loaded for V Chrominance Component Interrupt Mask Mask */
#define LCDC_HEOIMR_VDSCR(value)              (LCDC_HEOIMR_VDSCR_Msk & ((value) << LCDC_HEOIMR_VDSCR_Pos))
#define LCDC_HEOIMR_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOIMR) Head Descriptor Loaded for V Chrominance Component Mask Position */
#define LCDC_HEOIMR_VADD_Msk                  (_U_(0x1) << LCDC_HEOIMR_VADD_Pos)                   /**< (LCDC_HEOIMR) Head Descriptor Loaded for V Chrominance Component Mask Mask */
#define LCDC_HEOIMR_VADD(value)               (LCDC_HEOIMR_VADD_Msk & ((value) << LCDC_HEOIMR_VADD_Pos))
#define LCDC_HEOIMR_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOIMR) End of List for V Chrominance Component Mask Position */
#define LCDC_HEOIMR_VDONE_Msk                 (_U_(0x1) << LCDC_HEOIMR_VDONE_Pos)                  /**< (LCDC_HEOIMR) End of List for V Chrominance Component Mask Mask */
#define LCDC_HEOIMR_VDONE(value)              (LCDC_HEOIMR_VDONE_Msk & ((value) << LCDC_HEOIMR_VDONE_Pos))
#define LCDC_HEOIMR_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOIMR) Overflow for V Chrominance Interrupt Mask Position */
#define LCDC_HEOIMR_VOVR_Msk                  (_U_(0x1) << LCDC_HEOIMR_VOVR_Pos)                   /**< (LCDC_HEOIMR) Overflow for V Chrominance Interrupt Mask Mask */
#define LCDC_HEOIMR_VOVR(value)               (LCDC_HEOIMR_VOVR_Msk & ((value) << LCDC_HEOIMR_VOVR_Pos))
#define LCDC_HEOIMR_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOIMR) Register Mask  */


/* -------- LCDC_HEOISR : (LCDC Offset: 0x378) ( R/ 32) High-End Overlay Interrupt Status Register -------- */
#define LCDC_HEOISR_DMA_Pos                   _U_(2)                                               /**< (LCDC_HEOISR) End of DMA Transfer Position */
#define LCDC_HEOISR_DMA_Msk                   (_U_(0x1) << LCDC_HEOISR_DMA_Pos)                    /**< (LCDC_HEOISR) End of DMA Transfer Mask */
#define LCDC_HEOISR_DMA(value)                (LCDC_HEOISR_DMA_Msk & ((value) << LCDC_HEOISR_DMA_Pos))
#define LCDC_HEOISR_DSCR_Pos                  _U_(3)                                               /**< (LCDC_HEOISR) DMA Descriptor Loaded Position */
#define LCDC_HEOISR_DSCR_Msk                  (_U_(0x1) << LCDC_HEOISR_DSCR_Pos)                   /**< (LCDC_HEOISR) DMA Descriptor Loaded Mask */
#define LCDC_HEOISR_DSCR(value)               (LCDC_HEOISR_DSCR_Msk & ((value) << LCDC_HEOISR_DSCR_Pos))
#define LCDC_HEOISR_ADD_Pos                   _U_(4)                                               /**< (LCDC_HEOISR) Head Descriptor Loaded Position */
#define LCDC_HEOISR_ADD_Msk                   (_U_(0x1) << LCDC_HEOISR_ADD_Pos)                    /**< (LCDC_HEOISR) Head Descriptor Loaded Mask */
#define LCDC_HEOISR_ADD(value)                (LCDC_HEOISR_ADD_Msk & ((value) << LCDC_HEOISR_ADD_Pos))
#define LCDC_HEOISR_DONE_Pos                  _U_(5)                                               /**< (LCDC_HEOISR) End of List Detected Position */
#define LCDC_HEOISR_DONE_Msk                  (_U_(0x1) << LCDC_HEOISR_DONE_Pos)                   /**< (LCDC_HEOISR) End of List Detected Mask */
#define LCDC_HEOISR_DONE(value)               (LCDC_HEOISR_DONE_Msk & ((value) << LCDC_HEOISR_DONE_Pos))
#define LCDC_HEOISR_OVR_Pos                   _U_(6)                                               /**< (LCDC_HEOISR) Overflow Detected Position */
#define LCDC_HEOISR_OVR_Msk                   (_U_(0x1) << LCDC_HEOISR_OVR_Pos)                    /**< (LCDC_HEOISR) Overflow Detected Mask */
#define LCDC_HEOISR_OVR(value)                (LCDC_HEOISR_OVR_Msk & ((value) << LCDC_HEOISR_OVR_Pos))
#define LCDC_HEOISR_UDMA_Pos                  _U_(10)                                              /**< (LCDC_HEOISR) End of DMA Transfer for U Component Position */
#define LCDC_HEOISR_UDMA_Msk                  (_U_(0x1) << LCDC_HEOISR_UDMA_Pos)                   /**< (LCDC_HEOISR) End of DMA Transfer for U Component Mask */
#define LCDC_HEOISR_UDMA(value)               (LCDC_HEOISR_UDMA_Msk & ((value) << LCDC_HEOISR_UDMA_Pos))
#define LCDC_HEOISR_UDSCR_Pos                 _U_(11)                                              /**< (LCDC_HEOISR) DMA Descriptor Loaded for U Component Position */
#define LCDC_HEOISR_UDSCR_Msk                 (_U_(0x1) << LCDC_HEOISR_UDSCR_Pos)                  /**< (LCDC_HEOISR) DMA Descriptor Loaded for U Component Mask */
#define LCDC_HEOISR_UDSCR(value)              (LCDC_HEOISR_UDSCR_Msk & ((value) << LCDC_HEOISR_UDSCR_Pos))
#define LCDC_HEOISR_UADD_Pos                  _U_(12)                                              /**< (LCDC_HEOISR) Head Descriptor Loaded for U Component Position */
#define LCDC_HEOISR_UADD_Msk                  (_U_(0x1) << LCDC_HEOISR_UADD_Pos)                   /**< (LCDC_HEOISR) Head Descriptor Loaded for U Component Mask */
#define LCDC_HEOISR_UADD(value)               (LCDC_HEOISR_UADD_Msk & ((value) << LCDC_HEOISR_UADD_Pos))
#define LCDC_HEOISR_UDONE_Pos                 _U_(13)                                              /**< (LCDC_HEOISR) End of List Detected for U Component Position */
#define LCDC_HEOISR_UDONE_Msk                 (_U_(0x1) << LCDC_HEOISR_UDONE_Pos)                  /**< (LCDC_HEOISR) End of List Detected for U Component Mask */
#define LCDC_HEOISR_UDONE(value)              (LCDC_HEOISR_UDONE_Msk & ((value) << LCDC_HEOISR_UDONE_Pos))
#define LCDC_HEOISR_UOVR_Pos                  _U_(14)                                              /**< (LCDC_HEOISR) Overflow Detected for U Component Position */
#define LCDC_HEOISR_UOVR_Msk                  (_U_(0x1) << LCDC_HEOISR_UOVR_Pos)                   /**< (LCDC_HEOISR) Overflow Detected for U Component Mask */
#define LCDC_HEOISR_UOVR(value)               (LCDC_HEOISR_UOVR_Msk & ((value) << LCDC_HEOISR_UOVR_Pos))
#define LCDC_HEOISR_VDMA_Pos                  _U_(18)                                              /**< (LCDC_HEOISR) End of DMA Transfer for V Component Position */
#define LCDC_HEOISR_VDMA_Msk                  (_U_(0x1) << LCDC_HEOISR_VDMA_Pos)                   /**< (LCDC_HEOISR) End of DMA Transfer for V Component Mask */
#define LCDC_HEOISR_VDMA(value)               (LCDC_HEOISR_VDMA_Msk & ((value) << LCDC_HEOISR_VDMA_Pos))
#define LCDC_HEOISR_VDSCR_Pos                 _U_(19)                                              /**< (LCDC_HEOISR) DMA Descriptor Loaded for V Component Position */
#define LCDC_HEOISR_VDSCR_Msk                 (_U_(0x1) << LCDC_HEOISR_VDSCR_Pos)                  /**< (LCDC_HEOISR) DMA Descriptor Loaded for V Component Mask */
#define LCDC_HEOISR_VDSCR(value)              (LCDC_HEOISR_VDSCR_Msk & ((value) << LCDC_HEOISR_VDSCR_Pos))
#define LCDC_HEOISR_VADD_Pos                  _U_(20)                                              /**< (LCDC_HEOISR) Head Descriptor Loaded for V Component Position */
#define LCDC_HEOISR_VADD_Msk                  (_U_(0x1) << LCDC_HEOISR_VADD_Pos)                   /**< (LCDC_HEOISR) Head Descriptor Loaded for V Component Mask */
#define LCDC_HEOISR_VADD(value)               (LCDC_HEOISR_VADD_Msk & ((value) << LCDC_HEOISR_VADD_Pos))
#define LCDC_HEOISR_VDONE_Pos                 _U_(21)                                              /**< (LCDC_HEOISR) End of List Detected for V Component Position */
#define LCDC_HEOISR_VDONE_Msk                 (_U_(0x1) << LCDC_HEOISR_VDONE_Pos)                  /**< (LCDC_HEOISR) End of List Detected for V Component Mask */
#define LCDC_HEOISR_VDONE(value)              (LCDC_HEOISR_VDONE_Msk & ((value) << LCDC_HEOISR_VDONE_Pos))
#define LCDC_HEOISR_VOVR_Pos                  _U_(22)                                              /**< (LCDC_HEOISR) Overflow Detected for V Component Position */
#define LCDC_HEOISR_VOVR_Msk                  (_U_(0x1) << LCDC_HEOISR_VOVR_Pos)                   /**< (LCDC_HEOISR) Overflow Detected for V Component Mask */
#define LCDC_HEOISR_VOVR(value)               (LCDC_HEOISR_VOVR_Msk & ((value) << LCDC_HEOISR_VOVR_Pos))
#define LCDC_HEOISR_Msk                       _U_(0x007C7C7C)                                      /**< (LCDC_HEOISR) Register Mask  */


/* -------- LCDC_HEOHEAD : (LCDC Offset: 0x37C) (R/W 32) High-End Overlay DMA Head Register -------- */
#define LCDC_HEOHEAD_HEAD_Pos                 _U_(2)                                               /**< (LCDC_HEOHEAD) DMA Head Pointer Position */
#define LCDC_HEOHEAD_HEAD_Msk                 (_U_(0x3FFFFFFF) << LCDC_HEOHEAD_HEAD_Pos)           /**< (LCDC_HEOHEAD) DMA Head Pointer Mask */
#define LCDC_HEOHEAD_HEAD(value)              (LCDC_HEOHEAD_HEAD_Msk & ((value) << LCDC_HEOHEAD_HEAD_Pos))
#define LCDC_HEOHEAD_Msk                      _U_(0xFFFFFFFC)                                      /**< (LCDC_HEOHEAD) Register Mask  */


