Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_HEOADDR : (LCDC Offset: 0x380) (R/W 32) High-End Overlay DMA Address Register -------- */
#define LCDC_HEOADDR_ADDR_Pos                 _U_(0)                                               /**< (LCDC_HEOADDR) DMA Transfer Start Address Position */
#define LCDC_HEOADDR_ADDR_Msk                 (_U_(0xFFFFFFFF) << LCDC_HEOADDR_ADDR_Pos)           /**< (LCDC_HEOADDR) DMA Transfer Start Address Mask */
#define LCDC_HEOADDR_ADDR(value)              (LCDC_HEOADDR_ADDR_Msk & ((value) << LCDC_HEOADDR_ADDR_Pos))
#define LCDC_HEOADDR_Msk                      _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOADDR) Register Mask  */


/* -------- LCDC_HEOCTRL : (LCDC Offset: 0x384) (R/W 32) High-End Overlay DMA Control Register -------- */
#define LCDC_HEOCTRL_DFETCH_Pos               _U_(0)                                               /**< (LCDC_HEOCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_HEOCTRL_DFETCH_Msk               (_U_(0x1) << LCDC_HEOCTRL_DFETCH_Pos)                /**< (LCDC_HEOCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_HEOCTRL_DFETCH(value)            (LCDC_HEOCTRL_DFETCH_Msk & ((value) << LCDC_HEOCTRL_DFETCH_Pos))
#define LCDC_HEOCTRL_LFETCH_Pos               _U_(1)                                               /**< (LCDC_HEOCTRL) Lookup Table Fetch Enable Position */
#define LCDC_HEOCTRL_LFETCH_Msk               (_U_(0x1) << LCDC_HEOCTRL_LFETCH_Pos)                /**< (LCDC_HEOCTRL) Lookup Table Fetch Enable Mask */
#define LCDC_HEOCTRL_LFETCH(value)            (LCDC_HEOCTRL_LFETCH_Msk & ((value) << LCDC_HEOCTRL_LFETCH_Pos))
#define LCDC_HEOCTRL_DMAIEN_Pos               _U_(2)                                               /**< (LCDC_HEOCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOCTRL_DMAIEN_Msk               (_U_(0x1) << LCDC_HEOCTRL_DMAIEN_Pos)                /**< (LCDC_HEOCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOCTRL_DMAIEN(value)            (LCDC_HEOCTRL_DMAIEN_Msk & ((value) << LCDC_HEOCTRL_DMAIEN_Pos))
#define LCDC_HEOCTRL_DSCRIEN_Pos              _U_(3)                                               /**< (LCDC_HEOCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOCTRL_DSCRIEN_Msk              (_U_(0x1) << LCDC_HEOCTRL_DSCRIEN_Pos)               /**< (LCDC_HEOCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOCTRL_DSCRIEN(value)           (LCDC_HEOCTRL_DSCRIEN_Msk & ((value) << LCDC_HEOCTRL_DSCRIEN_Pos))
#define LCDC_HEOCTRL_ADDIEN_Pos               _U_(4)                                               /**< (LCDC_HEOCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_HEOCTRL_ADDIEN_Msk               (_U_(0x1) << LCDC_HEOCTRL_ADDIEN_Pos)                /**< (LCDC_HEOCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_HEOCTRL_ADDIEN(value)            (LCDC_HEOCTRL_ADDIEN_Msk & ((value) << LCDC_HEOCTRL_ADDIEN_Pos))
#define LCDC_HEOCTRL_DONEIEN_Pos              _U_(5)                                               /**< (LCDC_HEOCTRL) End of List Interrupt Enable Position */
#define LCDC_HEOCTRL_DONEIEN_Msk              (_U_(0x1) << LCDC_HEOCTRL_DONEIEN_Pos)               /**< (LCDC_HEOCTRL) End of List Interrupt Enable Mask */
#define LCDC_HEOCTRL_DONEIEN(value)           (LCDC_HEOCTRL_DONEIEN_Msk & ((value) << LCDC_HEOCTRL_DONEIEN_Pos))
#define LCDC_HEOCTRL_Msk                      _U_(0x0000003F)                                      /**< (LCDC_HEOCTRL) Register Mask  */


/* -------- LCDC_HEONEXT : (LCDC Offset: 0x388) (R/W 32) High-End Overlay DMA Next Register -------- */
#define LCDC_HEONEXT_NEXT_Pos                 _U_(0)                                               /**< (LCDC_HEONEXT) DMA Descriptor Next Address Position */
#define LCDC_HEONEXT_NEXT_Msk                 (_U_(0xFFFFFFFF) << LCDC_HEONEXT_NEXT_Pos)           /**< (LCDC_HEONEXT) DMA Descriptor Next Address Mask */
#define LCDC_HEONEXT_NEXT(value)              (LCDC_HEONEXT_NEXT_Msk & ((value) << LCDC_HEONEXT_NEXT_Pos))
#define LCDC_HEONEXT_Msk                      _U_(0xFFFFFFFF)                                      /**< (LCDC_HEONEXT) Register Mask  */


/* -------- LCDC_HEOUHEAD : (LCDC Offset: 0x38C) (R/W 32) High-End Overlay U-UV DMA Head Register -------- */
#define LCDC_HEOUHEAD_UHEAD_Pos               _U_(0)                                               /**< (LCDC_HEOUHEAD) DMA Head Pointer Position */
#define LCDC_HEOUHEAD_UHEAD_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOUHEAD_UHEAD_Pos)         /**< (LCDC_HEOUHEAD) DMA Head Pointer Mask */
#define LCDC_HEOUHEAD_UHEAD(value)            (LCDC_HEOUHEAD_UHEAD_Msk & ((value) << LCDC_HEOUHEAD_UHEAD_Pos))
#define LCDC_HEOUHEAD_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOUHEAD) Register Mask  */


/* -------- LCDC_HEOUADDR : (LCDC Offset: 0x390) (R/W 32) High-End Overlay U-UV DMA Address Register -------- */
#define LCDC_HEOUADDR_UADDR_Pos               _U_(0)                                               /**< (LCDC_HEOUADDR) DMA Transfer Start Address for U or UV Chrominance Position */
#define LCDC_HEOUADDR_UADDR_Msk               (_U_(0xFFFFFFFF) << LCDC_HEOUADDR_UADDR_Pos)         /**< (LCDC_HEOUADDR) DMA Transfer Start Address for U or UV Chrominance Mask */
#define LCDC_HEOUADDR_UADDR(value)            (LCDC_HEOUADDR_UADDR_Msk & ((value) << LCDC_HEOUADDR_UADDR_Pos))
#define LCDC_HEOUADDR_Msk                     _U_(0xFFFFFFFF)                                      /**< (LCDC_HEOUADDR) Register Mask  */


/* -------- LCDC_HEOUCTRL : (LCDC Offset: 0x394) (R/W 32) High-End Overlay U-UV DMA Control Register -------- */
#define LCDC_HEOUCTRL_UDFETCH_Pos             _U_(0)                                               /**< (LCDC_HEOUCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_HEOUCTRL_UDFETCH_Msk             (_U_(0x1) << LCDC_HEOUCTRL_UDFETCH_Pos)              /**< (LCDC_HEOUCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_HEOUCTRL_UDFETCH(value)          (LCDC_HEOUCTRL_UDFETCH_Msk & ((value) << LCDC_HEOUCTRL_UDFETCH_Pos))
#define LCDC_HEOUCTRL_UDMAIEN_Pos             _U_(2)                                               /**< (LCDC_HEOUCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOUCTRL_UDMAIEN_Msk             (_U_(0x1) << LCDC_HEOUCTRL_UDMAIEN_Pos)              /**< (LCDC_HEOUCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UDMAIEN(value)          (LCDC_HEOUCTRL_UDMAIEN_Msk & ((value) << LCDC_HEOUCTRL_UDMAIEN_Pos))
#define LCDC_HEOUCTRL_UDSCRIEN_Pos            _U_(3)                                               /**< (LCDC_HEOUCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOUCTRL_UDSCRIEN_Msk            (_U_(0x1) << LCDC_HEOUCTRL_UDSCRIEN_Pos)             /**< (LCDC_HEOUCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UDSCRIEN(value)         (LCDC_HEOUCTRL_UDSCRIEN_Msk & ((value) << LCDC_HEOUCTRL_UDSCRIEN_Pos))
#define LCDC_HEOUCTRL_UADDIEN_Pos             _U_(4)                                               /**< (LCDC_HEOUCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_HEOUCTRL_UADDIEN_Msk             (_U_(0x1) << LCDC_HEOUCTRL_UADDIEN_Pos)              /**< (LCDC_HEOUCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UADDIEN(value)          (LCDC_HEOUCTRL_UADDIEN_Msk & ((value) << LCDC_HEOUCTRL_UADDIEN_Pos))
#define LCDC_HEOUCTRL_UDONEIEN_Pos            _U_(5)                                               /**< (LCDC_HEOUCTRL) End of List Interrupt Enable Position */
#define LCDC_HEOUCTRL_UDONEIEN_Msk            (_U_(0x1) << LCDC_HEOUCTRL_UDONEIEN_Pos)             /**< (LCDC_HEOUCTRL) End of List Interrupt Enable Mask */
#define LCDC_HEOUCTRL_UDONEIEN(value)         (LCDC_HEOUCTRL_UDONEIEN_Msk & ((value) << LCDC_HEOUCTRL_UDONEIEN_Pos))
#define LCDC_HEOUCTRL_Msk                     _U_(0x0000003D)                                      /**< (LCDC_HEOUCTRL) Register Mask  */


