Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG10 : (LCDC Offset: 0x3D4) (R/W 32) High-End Overlay Configuration Register 10 -------- */
#define LCDC_HEOCFG10_BKEY_Pos                _U_(0)                                               /**< (LCDC_HEOCFG10) Blue Color Component Chroma Key Position */
#define LCDC_HEOCFG10_BKEY_Msk                (_U_(0xFF) << LCDC_HEOCFG10_BKEY_Pos)                /**< (LCDC_HEOCFG10) Blue Color Component Chroma Key Mask */
#define LCDC_HEOCFG10_BKEY(value)             (LCDC_HEOCFG10_BKEY_Msk & ((value) << LCDC_HEOCFG10_BKEY_Pos))
#define LCDC_HEOCFG10_GKEY_Pos                _U_(8)                                               /**< (LCDC_HEOCFG10) Green Color Component Chroma Key Position */
#define LCDC_HEOCFG10_GKEY_Msk                (_U_(0xFF) << LCDC_HEOCFG10_GKEY_Pos)                /**< (LCDC_HEOCFG10) Green Color Component Chroma Key Mask */
#define LCDC_HEOCFG10_GKEY(value)             (LCDC_HEOCFG10_GKEY_Msk & ((value) << LCDC_HEOCFG10_GKEY_Pos))
#define LCDC_HEOCFG10_RKEY_Pos                _U_(16)                                              /**< (LCDC_HEOCFG10) Red Color Component Chroma Key Position */
#define LCDC_HEOCFG10_RKEY_Msk                (_U_(0xFF) << LCDC_HEOCFG10_RKEY_Pos)                /**< (LCDC_HEOCFG10) Red Color Component Chroma Key Mask */
#define LCDC_HEOCFG10_RKEY(value)             (LCDC_HEOCFG10_RKEY_Msk & ((value) << LCDC_HEOCFG10_RKEY_Pos))
#define LCDC_HEOCFG10_Msk                     _U_(0x00FFFFFF)                                      /**< (LCDC_HEOCFG10) Register Mask  */


/* -------- LCDC_HEOCFG11 : (LCDC Offset: 0x3D8) (R/W 32) High-End Overlay Configuration Register 11 -------- */
#define LCDC_HEOCFG11_BMASK_Pos               _U_(0)                                               /**< (LCDC_HEOCFG11) Blue Color Component Chroma Key Mask Position */
#define LCDC_HEOCFG11_BMASK_Msk               (_U_(0xFF) << LCDC_HEOCFG11_BMASK_Pos)               /**< (LCDC_HEOCFG11) Blue Color Component Chroma Key Mask Mask */
#define LCDC_HEOCFG11_BMASK(value)            (LCDC_HEOCFG11_BMASK_Msk & ((value) << LCDC_HEOCFG11_BMASK_Pos))
#define LCDC_HEOCFG11_GMASK_Pos               _U_(8)                                               /**< (LCDC_HEOCFG11) Green Color Component Chroma Key Mask Position */
#define LCDC_HEOCFG11_GMASK_Msk               (_U_(0xFF) << LCDC_HEOCFG11_GMASK_Pos)               /**< (LCDC_HEOCFG11) Green Color Component Chroma Key Mask Mask */
#define LCDC_HEOCFG11_GMASK(value)            (LCDC_HEOCFG11_GMASK_Msk & ((value) << LCDC_HEOCFG11_GMASK_Pos))
#define LCDC_HEOCFG11_RMASK_Pos               _U_(16)                                              /**< (LCDC_HEOCFG11) Red Color Component Chroma Key Mask Position */
#define LCDC_HEOCFG11_RMASK_Msk               (_U_(0xFF) << LCDC_HEOCFG11_RMASK_Pos)               /**< (LCDC_HEOCFG11) Red Color Component Chroma Key Mask Mask */
#define LCDC_HEOCFG11_RMASK(value)            (LCDC_HEOCFG11_RMASK_Msk & ((value) << LCDC_HEOCFG11_RMASK_Pos))
#define LCDC_HEOCFG11_Msk                     _U_(0x00FFFFFF)                                      /**< (LCDC_HEOCFG11) Register Mask  */


/* -------- LCDC_HEOCFG12 : (LCDC Offset: 0x3DC) (R/W 32) High-End Overlay Configuration Register 12 -------- */
#define LCDC_HEOCFG12_CRKEY_Pos               _U_(0)                                               /**< (LCDC_HEOCFG12) Blender Chroma Key Enable Position */
#define LCDC_HEOCFG12_CRKEY_Msk               (_U_(0x1) << LCDC_HEOCFG12_CRKEY_Pos)                /**< (LCDC_HEOCFG12) Blender Chroma Key Enable Mask */
#define LCDC_HEOCFG12_CRKEY(value)            (LCDC_HEOCFG12_CRKEY_Msk & ((value) << LCDC_HEOCFG12_CRKEY_Pos))
#define LCDC_HEOCFG12_INV_Pos                 _U_(1)                                               /**< (LCDC_HEOCFG12) Blender Inverted Blender Output Enable Position */
#define LCDC_HEOCFG12_INV_Msk                 (_U_(0x1) << LCDC_HEOCFG12_INV_Pos)                  /**< (LCDC_HEOCFG12) Blender Inverted Blender Output Enable Mask */
#define LCDC_HEOCFG12_INV(value)              (LCDC_HEOCFG12_INV_Msk & ((value) << LCDC_HEOCFG12_INV_Pos))
#define LCDC_HEOCFG12_ITER2BL_Pos             _U_(2)                                               /**< (LCDC_HEOCFG12) Blender Iterated Color Enable Position */
#define LCDC_HEOCFG12_ITER2BL_Msk             (_U_(0x1) << LCDC_HEOCFG12_ITER2BL_Pos)              /**< (LCDC_HEOCFG12) Blender Iterated Color Enable Mask */
#define LCDC_HEOCFG12_ITER2BL(value)          (LCDC_HEOCFG12_ITER2BL_Msk & ((value) << LCDC_HEOCFG12_ITER2BL_Pos))
#define LCDC_HEOCFG12_ITER_Pos                _U_(3)                                               /**< (LCDC_HEOCFG12) Blender Use Iterated Color Position */
#define LCDC_HEOCFG12_ITER_Msk                (_U_(0x1) << LCDC_HEOCFG12_ITER_Pos)                 /**< (LCDC_HEOCFG12) Blender Use Iterated Color Mask */
#define LCDC_HEOCFG12_ITER(value)             (LCDC_HEOCFG12_ITER_Msk & ((value) << LCDC_HEOCFG12_ITER_Pos))
#define LCDC_HEOCFG12_REVALPHA_Pos            _U_(4)                                               /**< (LCDC_HEOCFG12) Blender Reverse Alpha Position */
#define LCDC_HEOCFG12_REVALPHA_Msk            (_U_(0x1) << LCDC_HEOCFG12_REVALPHA_Pos)             /**< (LCDC_HEOCFG12) Blender Reverse Alpha Mask */
#define LCDC_HEOCFG12_REVALPHA(value)         (LCDC_HEOCFG12_REVALPHA_Msk & ((value) << LCDC_HEOCFG12_REVALPHA_Pos))
#define LCDC_HEOCFG12_GAEN_Pos                _U_(5)                                               /**< (LCDC_HEOCFG12) Blender Global Alpha Enable Position */
#define LCDC_HEOCFG12_GAEN_Msk                (_U_(0x1) << LCDC_HEOCFG12_GAEN_Pos)                 /**< (LCDC_HEOCFG12) Blender Global Alpha Enable Mask */
#define LCDC_HEOCFG12_GAEN(value)             (LCDC_HEOCFG12_GAEN_Msk & ((value) << LCDC_HEOCFG12_GAEN_Pos))
#define LCDC_HEOCFG12_LAEN_Pos                _U_(6)                                               /**< (LCDC_HEOCFG12) Blender Local Alpha Enable Position */
#define LCDC_HEOCFG12_LAEN_Msk                (_U_(0x1) << LCDC_HEOCFG12_LAEN_Pos)                 /**< (LCDC_HEOCFG12) Blender Local Alpha Enable Mask */
#define LCDC_HEOCFG12_LAEN(value)             (LCDC_HEOCFG12_LAEN_Msk & ((value) << LCDC_HEOCFG12_LAEN_Pos))
#define LCDC_HEOCFG12_OVR_Pos                 _U_(7)                                               /**< (LCDC_HEOCFG12) Blender Overlay Layer Enable Position */
#define LCDC_HEOCFG12_OVR_Msk                 (_U_(0x1) << LCDC_HEOCFG12_OVR_Pos)                  /**< (LCDC_HEOCFG12) Blender Overlay Layer Enable Mask */
#define LCDC_HEOCFG12_OVR(value)              (LCDC_HEOCFG12_OVR_Msk & ((value) << LCDC_HEOCFG12_OVR_Pos))
#define LCDC_HEOCFG12_DMA_Pos                 _U_(8)                                               /**< (LCDC_HEOCFG12) Blender DMA Layer Enable Position */
#define LCDC_HEOCFG12_DMA_Msk                 (_U_(0x1) << LCDC_HEOCFG12_DMA_Pos)                  /**< (LCDC_HEOCFG12) Blender DMA Layer Enable Mask */
#define LCDC_HEOCFG12_DMA(value)              (LCDC_HEOCFG12_DMA_Msk & ((value) << LCDC_HEOCFG12_DMA_Pos))
#define LCDC_HEOCFG12_REP_Pos                 _U_(9)                                               /**< (LCDC_HEOCFG12) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_HEOCFG12_REP_Msk                 (_U_(0x1) << LCDC_HEOCFG12_REP_Pos)                  /**< (LCDC_HEOCFG12) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_HEOCFG12_REP(value)              (LCDC_HEOCFG12_REP_Msk & ((value) << LCDC_HEOCFG12_REP_Pos))
#define LCDC_HEOCFG12_DSTKEY_Pos              _U_(10)                                              /**< (LCDC_HEOCFG12) Destination Chroma Keying Position */
#define LCDC_HEOCFG12_DSTKEY_Msk              (_U_(0x1) << LCDC_HEOCFG12_DSTKEY_Pos)               /**< (LCDC_HEOCFG12) Destination Chroma Keying Mask */
#define LCDC_HEOCFG12_DSTKEY(value)           (LCDC_HEOCFG12_DSTKEY_Msk & ((value) << LCDC_HEOCFG12_DSTKEY_Pos))
#define LCDC_HEOCFG12_VIDPRI_Pos              _U_(12)                                              /**< (LCDC_HEOCFG12) Video Priority Position */
#define LCDC_HEOCFG12_VIDPRI_Msk              (_U_(0x1) << LCDC_HEOCFG12_VIDPRI_Pos)               /**< (LCDC_HEOCFG12) Video Priority Mask */
#define LCDC_HEOCFG12_VIDPRI(value)           (LCDC_HEOCFG12_VIDPRI_Msk & ((value) << LCDC_HEOCFG12_VIDPRI_Pos))
#define LCDC_HEOCFG12_GA_Pos                  _U_(16)                                              /**< (LCDC_HEOCFG12) Blender Global Alpha Position */
#define LCDC_HEOCFG12_GA_Msk                  (_U_(0xFF) << LCDC_HEOCFG12_GA_Pos)                  /**< (LCDC_HEOCFG12) Blender Global Alpha Mask */
#define LCDC_HEOCFG12_GA(value)               (LCDC_HEOCFG12_GA_Msk & ((value) << LCDC_HEOCFG12_GA_Pos))
#define LCDC_HEOCFG12_Msk                     _U_(0x00FF17FF)                                      /**< (LCDC_HEOCFG12) Register Mask  */


